---------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lesliehuang/Dropbox/MA-thesis-analysis/MA_mnl.log
  log type:  text
 opened on:  24 Aug 2016, 22:45:48

. 
. * import data from R: already cleaned and transformed
. use mnl_data.dta
(Written by R.              )

. 
. * convert dates to stata format
. gen statadate = date - td(01jan1960)

. format statadate %td

. 
. * tsset statadate, daily
. 
. * need to make some factors
. describe year

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------
year            str4    %4s                   year

. destring year, replace
year has all characters numeric; replaced as int

. 
. * MNL Model #1
. mlogit state_y i.state_x FARC_actions pres_approve i.year

Iteration 0:   log likelihood = -421.28337  
Iteration 1:   log likelihood = -337.81502  
Iteration 2:   log likelihood = -334.25793  
Iteration 3:   log likelihood = -334.10685  
Iteration 4:   log likelihood = -334.10593  
Iteration 5:   log likelihood = -334.10593  

Multinomial logistic regression                 Number of obs     =        334
                                                LR chi2(27)       =     174.35
                                                Prob > chi2       =     0.0000
Log likelihood = -334.10593                     Pseudo R2         =     0.2069

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   -.808817   .6190229    -1.31   0.191    -2.022079    .4044456
          3  |   -3.21843   1.131565    -2.84   0.004    -5.436257   -1.000603
          4  |   -1.60129   .5557819    -2.88   0.004    -2.690603   -.5119774
             |
FARC_actions |   .4254625   .3171159     1.34   0.180    -.1960731    1.046998
pres_approve |   2.185481   2.016262     1.08   0.278    -1.766321    6.137283
             |
        year |
       2013  |  -1.798422   .8842566    -2.03   0.042    -3.531533   -.0653109
       2014  |   .3816552   1.189664     0.32   0.748    -1.950043    2.713354
       2015  |   1.846004   1.409303     1.31   0.190    -.9161797    4.608187
       2016  |   1.848568    1.68671     1.10   0.273    -1.457323    5.154458
             |
       _cons |  -10.17706   8.907175    -1.14   0.253    -27.63481    7.280677
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.6594005   .5834575    -1.13   0.258    -1.802956    .4841552
          3  |  -1.002562   .6107251    -1.64   0.101    -2.199561    .1944372
          4  |  -1.708308   .5446288    -3.14   0.002    -2.775761   -.6408556
             |
FARC_actions |   .7071676   .2839869     2.49   0.013     .1505634    1.263772
pres_approve |   2.950238   1.818593     1.62   0.105     -.614139    6.514615
             |
        year |
       2013  |  -2.096949   .7755899    -2.70   0.007    -3.617077   -.5768203
       2014  |   .1478405   1.070112     0.14   0.890     -1.94954    2.245221
       2015  |   3.045693   1.302343     2.34   0.019     .4931473    5.598239
       2016  |   2.455044   1.557661     1.58   0.115    -.5979145    5.508003
             |
       _cons |   -14.1542   8.102372    -1.75   0.081    -30.03456    1.726156
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.6626266   .7795603    -0.85   0.395    -2.190537    .8652834
          3  |   .9316423   .6327113     1.47   0.141     -.308449    2.171734
          4  |    -.31555   .6196128    -0.51   0.611    -1.529969    .8988689
             |
FARC_actions |   .5864596   .3373573     1.74   0.082    -.0747485    1.247668
pres_approve |  -1.531998   1.463405    -1.05   0.295    -4.400219    1.336223
             |
        year |
       2013  |  -1.348947   1.045774    -1.29   0.197    -3.398626    .7007326
       2014  |   .6294811   1.129454     0.56   0.577    -1.584208     2.84317
       2015  |   1.419163     1.4955     0.95   0.343    -1.511962    4.350289
       2016  |   2.020566     1.6957     1.19   0.233    -1.302944    5.344076
             |
       _cons |   3.215619   6.735421     0.48   0.633    -9.985563     16.4168
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD07650.000000"

. 
. margins state_x, atmeans predict(outcome(1))

Adjusted predictions                            Number of obs     =        334
Model VCE    : OIM

Expression   : Pr(state_y==1), predict(outcome(1))
at           : 1.state_x       =    .1137725 (mean)
               2.state_x       =    .1676647 (mean)
               3.state_x       =    .2754491 (mean)
               4.state_x       =    .4431138 (mean)
               FARC_actions    =    3.761786 (mean)
               pres_approve    =    3.997687 (mean)
               2012.year       =    .1047904 (mean)
               2013.year       =    .4101796 (mean)
               2014.year       =     .242515 (mean)
               2015.year       =    .0988024 (mean)
               2016.year       =    .1437126 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     state_x |
          1  |   .2668177   .0773859     3.45   0.001     .1151441    .4184914
          2  |   .1882025   .0590483     3.19   0.001       .07247     .303935
          3  |   .0140176   .0140073     1.00   0.317    -.0134363    .0414714
          4  |   .1096326   .0293022     3.74   0.000     .0522013    .1670639
------------------------------------------------------------------------------

. 
end of do-file

. cor sentiment_level year
(obs=352)

             | sentim~l     year
-------------+------------------
sentiment_~l |   1.0000
        year |  -0.1799   1.0000


. reg sentiment_level year

      Source |       SS           df       MS      Number of obs   =       352
-------------+----------------------------------   F(1, 350)       =     11.70
       Model |  2.72140529         1  2.72140529   Prob > F        =    0.0007
    Residual |  81.3893902       350  .232541115   R-squared       =    0.0324
-------------+----------------------------------   Adj R-squared   =    0.0296
       Total |  84.1107955       351  .239631896   Root MSE        =    .48223

------------------------------------------------------------------------------
sentiment_~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |  -.0727527   .0212668    -3.42   0.001    -.1145795   -.0309259
       _cons |   147.1131   42.82671     3.44   0.001     62.88305    231.3432
------------------------------------------------------------------------------

. cor sentiment_level i.year
factor variables not allowed
r(101);

. tab sentiment_level year

sentiment_ |                          year
     level |      2012       2013       2014       2015       2016 |     Total
-----------+-------------------------------------------------------+----------
         0 |        11         33         58         12         25 |       139 
         1 |        24        113         27         21         28 |       213 
-----------+-------------------------------------------------------+----------
     Total |        35        146         85         33         53 |       352 


. ssc install femlogit
ssc install: "femlogit" not found at SSC, type -findit femlogit-
(To find all packages at SSC that start with f, type -ssc describe f-)
r(601);

. findit femlogit

. femlogit state_y state_x , fe
option fe not allowed
r(198);

. femlogit state_y state_x i.year
factor variables and time-series operators not allowed
r(101);

. femlogit state_y state_x
must specify panelvar; use xtset
something that should be true of your data is not
r(459);

. xtset
panel variable not set; use xtset varname ...
r(459);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD07650.000000"

. gen ID = _n

. 
end of do-file

. xtset
panel variable not set; use xtset varname ...
r(459);

. xtset ID year
       panel variable:  ID (weakly balanced)
        time variable:  year, 2012 to 2016
                delta:  1 unit

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD07650.000000"

. mlogit state_y i.state_x FARC_actions pres_approve i.year

Iteration 0:   log likelihood = -421.28337  
Iteration 1:   log likelihood = -337.81502  
Iteration 2:   log likelihood = -334.25793  
Iteration 3:   log likelihood = -334.10685  
Iteration 4:   log likelihood = -334.10593  
Iteration 5:   log likelihood = -334.10593  

Multinomial logistic regression                 Number of obs     =        334
                                                LR chi2(27)       =     174.35
                                                Prob > chi2       =     0.0000
Log likelihood = -334.10593                     Pseudo R2         =     0.2069

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   -.808817   .6190229    -1.31   0.191    -2.022079    .4044456
          3  |   -3.21843   1.131565    -2.84   0.004    -5.436257   -1.000603
          4  |   -1.60129   .5557819    -2.88   0.004    -2.690603   -.5119774
             |
FARC_actions |   .4254625   .3171159     1.34   0.180    -.1960731    1.046998
pres_approve |   2.185481   2.016262     1.08   0.278    -1.766321    6.137283
             |
        year |
       2013  |  -1.798422   .8842566    -2.03   0.042    -3.531533   -.0653109
       2014  |   .3816552   1.189664     0.32   0.748    -1.950043    2.713354
       2015  |   1.846004   1.409303     1.31   0.190    -.9161797    4.608187
       2016  |   1.848568    1.68671     1.10   0.273    -1.457323    5.154458
             |
       _cons |  -10.17706   8.907175    -1.14   0.253    -27.63481    7.280677
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.6594005   .5834575    -1.13   0.258    -1.802956    .4841552
          3  |  -1.002562   .6107251    -1.64   0.101    -2.199561    .1944372
          4  |  -1.708308   .5446288    -3.14   0.002    -2.775761   -.6408556
             |
FARC_actions |   .7071676   .2839869     2.49   0.013     .1505634    1.263772
pres_approve |   2.950238   1.818593     1.62   0.105     -.614139    6.514615
             |
        year |
       2013  |  -2.096949   .7755899    -2.70   0.007    -3.617077   -.5768203
       2014  |   .1478405   1.070112     0.14   0.890     -1.94954    2.245221
       2015  |   3.045693   1.302343     2.34   0.019     .4931473    5.598239
       2016  |   2.455044   1.557661     1.58   0.115    -.5979145    5.508003
             |
       _cons |   -14.1542   8.102372    -1.75   0.081    -30.03456    1.726156
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.6626266   .7795603    -0.85   0.395    -2.190537    .8652834
          3  |   .9316423   .6327113     1.47   0.141     -.308449    2.171734
          4  |    -.31555   .6196128    -0.51   0.611    -1.529969    .8988689
             |
FARC_actions |   .5864596   .3373573     1.74   0.082    -.0747485    1.247668
pres_approve |  -1.531998   1.463405    -1.05   0.295    -4.400219    1.336223
             |
        year |
       2013  |  -1.348947   1.045774    -1.29   0.197    -3.398626    .7007326
       2014  |   .6294811   1.129454     0.56   0.577    -1.584208     2.84317
       2015  |   1.419163     1.4955     0.95   0.343    -1.511962    4.350289
       2016  |   2.020566     1.6957     1.19   0.233    -1.302944    5.344076
             |
       _cons |   3.215619   6.735421     0.48   0.633    -9.985563     16.4168
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
end of do-file

. femlogit state_y state_x i.year
factor variables and time-series operators not allowed
r(101);

. femlogit state_y state_x
outcome does not vary in any group
r(2000);

. femlogit state_y state_x year
outcome does not vary in any group
r(2000);

. femlogit state_y state_x, group(year)

--Break--
r(1);

. doedit femlogit_example2.do

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD07650.000000"

. mlogit state_y i.state_x FARC_actions pres_approve i.year

Iteration 0:   log likelihood = -421.28337  
Iteration 1:   log likelihood = -337.81502  
Iteration 2:   log likelihood = -334.25793  
Iteration 3:   log likelihood = -334.10685  
Iteration 4:   log likelihood = -334.10593  
Iteration 5:   log likelihood = -334.10593  

Multinomial logistic regression                 Number of obs     =        334
                                                LR chi2(27)       =     174.35
                                                Prob > chi2       =     0.0000
Log likelihood = -334.10593                     Pseudo R2         =     0.2069

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   -.808817   .6190229    -1.31   0.191    -2.022079    .4044456
          3  |   -3.21843   1.131565    -2.84   0.004    -5.436257   -1.000603
          4  |   -1.60129   .5557819    -2.88   0.004    -2.690603   -.5119774
             |
FARC_actions |   .4254625   .3171159     1.34   0.180    -.1960731    1.046998
pres_approve |   2.185481   2.016262     1.08   0.278    -1.766321    6.137283
             |
        year |
       2013  |  -1.798422   .8842566    -2.03   0.042    -3.531533   -.0653109
       2014  |   .3816552   1.189664     0.32   0.748    -1.950043    2.713354
       2015  |   1.846004   1.409303     1.31   0.190    -.9161797    4.608187
       2016  |   1.848568    1.68671     1.10   0.273    -1.457323    5.154458
             |
       _cons |  -10.17706   8.907175    -1.14   0.253    -27.63481    7.280677
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.6594005   .5834575    -1.13   0.258    -1.802956    .4841552
          3  |  -1.002562   .6107251    -1.64   0.101    -2.199561    .1944372
          4  |  -1.708308   .5446288    -3.14   0.002    -2.775761   -.6408556
             |
FARC_actions |   .7071676   .2839869     2.49   0.013     .1505634    1.263772
pres_approve |   2.950238   1.818593     1.62   0.105     -.614139    6.514615
             |
        year |
       2013  |  -2.096949   .7755899    -2.70   0.007    -3.617077   -.5768203
       2014  |   .1478405   1.070112     0.14   0.890     -1.94954    2.245221
       2015  |   3.045693   1.302343     2.34   0.019     .4931473    5.598239
       2016  |   2.455044   1.557661     1.58   0.115    -.5979145    5.508003
             |
       _cons |   -14.1542   8.102372    -1.75   0.081    -30.03456    1.726156
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.6626266   .7795603    -0.85   0.395    -2.190537    .8652834
          3  |   .9316423   .6327113     1.47   0.141     -.308449    2.171734
          4  |    -.31555   .6196128    -0.51   0.611    -1.529969    .8988689
             |
FARC_actions |   .5864596   .3373573     1.74   0.082    -.0747485    1.247668
pres_approve |  -1.531998   1.463405    -1.05   0.295    -4.400219    1.336223
             |
        year |
       2013  |  -1.348947   1.045774    -1.29   0.197    -3.398626    .7007326
       2014  |   .6294811   1.129454     0.56   0.577    -1.584208     2.84317
       2015  |   1.419163     1.4955     0.95   0.343    -1.511962    4.350289
       2016  |   2.020566     1.6957     1.19   0.233    -1.302944    5.344076
             |
       _cons |   3.215619   6.735421     0.48   0.633    -9.985563     16.4168
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
end of do-file

. estimates store fixed

. hausman fixed
the two models need to be different
r(198);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD07650.000000"

. mlogit state_y i.state_x army_casualties pres_approve i.year

Iteration 0:   log likelihood = -438.16878  
Iteration 1:   log likelihood = -354.63682  
Iteration 2:   log likelihood = -351.55903  
Iteration 3:   log likelihood = -351.44305  
Iteration 4:   log likelihood = -351.44227  
Iteration 5:   log likelihood = -351.44227  

Multinomial logistic regression                 Number of obs     =        343
                                                LR chi2(27)       =     173.45
                                                Prob > chi2       =     0.0000
Log likelihood = -351.44227                     Pseudo R2         =     0.1979

---------------------------------------------------------------------------------
        state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1               |
        state_x |
             2  |  -.3051091   .5851146    -0.52   0.602    -1.451913    .8416944
             3  |  -3.169758   1.128488    -2.81   0.005    -5.381554   -.9579616
             4  |  -1.587557   .5511261    -2.88   0.004    -2.667744   -.5073699
                |
army_casualties |   .4695831   .4455113     1.05   0.292     -.403603    1.342769
   pres_approve |  -.1837427    1.80422    -0.10   0.919    -3.719949    3.352464
                |
           year |
          2013  |  -1.252856   .7107025    -1.76   0.078    -2.645808     .140095
          2014  |  -.3306384    1.13441    -0.29   0.771    -2.554042    1.892765
          2015  |   .0696715   1.094851     0.06   0.949    -2.076198    2.215541
          2016  |  -.2895994   1.207006    -0.24   0.810    -2.655288    2.076089
                |
          _cons |  -.1966736   7.899564    -0.02   0.980    -15.67953    15.28619
----------------+----------------------------------------------------------------
2               |
        state_x |
             2  |  -.3012678   .5276862    -0.57   0.568    -1.335514    .7329782
             3  |  -1.200494   .5803588    -2.07   0.039    -2.337976   -.0630115
             4  |  -1.988546   .5122538    -3.88   0.000    -2.992545   -.9845469
                |
army_casualties |   .3083634   .3706998     0.83   0.405    -.4181949    1.034922
   pres_approve |  -.0451272   1.530679    -0.03   0.976    -3.045202    2.954948
                |
           year |
          2013  |  -1.176017   .6092866    -1.93   0.054    -2.370197     .018163
          2014  |  -.6932542   .9818719    -0.71   0.480    -2.617688    1.231179
          2015  |   .2408189   .9287213     0.26   0.795    -1.579441    2.061079
          2016  |   -1.17332   1.039094    -1.13   0.259    -3.209908     .863267
                |
          _cons |    .309217   6.653624     0.05   0.963    -12.73165    13.35008
----------------+----------------------------------------------------------------
3               |
        state_x |
             2  |  -.5411191   .7666036    -0.71   0.480    -2.043635    .9613963
             3  |    .977945   .6293273     1.55   0.120    -.2555139    2.211404
             4  |  -.3115991   .6166573    -0.51   0.613    -1.520225    .8970269
                |
army_casualties |  -.0450598   .4220756    -0.11   0.915    -.8723129    .7821932
   pres_approve |  -2.704252   1.386164    -1.95   0.051    -5.421083    .0125786
                |
           year |
          2013  |  -.2788529   .9205919    -0.30   0.762     -2.08318    1.525474
          2014  |   .8028468   1.119942     0.72   0.473    -1.392198    2.997892
          2015  |  -.2285757     1.1858    -0.19   0.847    -2.552702     2.09555
          2016  |  -.3500365   1.072506    -0.33   0.744     -2.45211    1.752037
                |
          _cons |   10.18304   6.200195     1.64   0.101    -1.969122     22.3352
----------------+----------------------------------------------------------------
4               |  (base outcome)
---------------------------------------------------------------------------------

. 
end of do-file

. estimates store fixed2

. hausman fixed fixed2

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed        fixed2       Difference          S.E.
-------------+----------------------------------------------------------------
     state_x |
          2  |    -.808817    -.3051091       -.5037079        .2020649
          3  |    -3.21843    -3.169758       -.0486721        .0833936
          4  |    -1.60129    -1.587557       -.0137328        .0717884
pres_approve |    2.185481    -.1837427        2.369224        .9000576
        year |
       2013  |   -1.798422    -1.252856       -.5455657         .526129
       2014  |    .3816552    -.3306384        .7122936        .3583488
       2015  |    1.846004     .0696715        1.776332        .8873759
       2016  |    1.848568    -.2895994        2.138167        1.178187
------------------------------------------------------------------------------
                          b = consistent under Ho and Ha; obtained from mlogit
           B = inconsistent under Ha, efficient under Ho; obtained from mlogit

    Test:  Ho:  difference in coefficients not systematic

                  chi2(8) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =        7.24
                Prob>chi2 =      0.5107
                (V_b-V_B is not positive definite)

. hausman fixed.
estimation result fixed. not found
r(111);

. hausman fixed .

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed        fixed2       Difference          S.E.
-------------+----------------------------------------------------------------
     state_x |
          2  |    -.808817    -.3051091       -.5037079        .2020649
          3  |    -3.21843    -3.169758       -.0486721        .0833936
          4  |    -1.60129    -1.587557       -.0137328        .0717884
pres_approve |    2.185481    -.1837427        2.369224        .9000576
        year |
       2013  |   -1.798422    -1.252856       -.5455657         .526129
       2014  |    .3816552    -.3306384        .7122936        .3583488
       2015  |    1.846004     .0696715        1.776332        .8873759
       2016  |    1.848568    -.2895994        2.138167        1.178187
------------------------------------------------------------------------------
                          b = consistent under Ho and Ha; obtained from mlogit
           B = inconsistent under Ha, efficient under Ho; obtained from mlogit

    Test:  Ho:  difference in coefficients not systematic

                  chi2(8) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =        7.24
                Prob>chi2 =      0.5107
                (V_b-V_B is not positive definite)

. smhsiao
varlist required
r(100);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD07650.000000"

. mlogit state_y i.state_x FARC_actions pres_approve i.year

Iteration 0:   log likelihood = -421.28337  
Iteration 1:   log likelihood = -337.81502  
Iteration 2:   log likelihood = -334.25793  
Iteration 3:   log likelihood = -334.10685  
Iteration 4:   log likelihood = -334.10593  
Iteration 5:   log likelihood = -334.10593  

Multinomial logistic regression                 Number of obs     =        334
                                                LR chi2(27)       =     174.35
                                                Prob > chi2       =     0.0000
Log likelihood = -334.10593                     Pseudo R2         =     0.2069

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   -.808817   .6190229    -1.31   0.191    -2.022079    .4044456
          3  |   -3.21843   1.131565    -2.84   0.004    -5.436257   -1.000603
          4  |   -1.60129   .5557819    -2.88   0.004    -2.690603   -.5119774
             |
FARC_actions |   .4254625   .3171159     1.34   0.180    -.1960731    1.046998
pres_approve |   2.185481   2.016262     1.08   0.278    -1.766321    6.137283
             |
        year |
       2013  |  -1.798422   .8842566    -2.03   0.042    -3.531533   -.0653109
       2014  |   .3816552   1.189664     0.32   0.748    -1.950043    2.713354
       2015  |   1.846004   1.409303     1.31   0.190    -.9161797    4.608187
       2016  |   1.848568    1.68671     1.10   0.273    -1.457323    5.154458
             |
       _cons |  -10.17706   8.907175    -1.14   0.253    -27.63481    7.280677
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.6594005   .5834575    -1.13   0.258    -1.802956    .4841552
          3  |  -1.002562   .6107251    -1.64   0.101    -2.199561    .1944372
          4  |  -1.708308   .5446288    -3.14   0.002    -2.775761   -.6408556
             |
FARC_actions |   .7071676   .2839869     2.49   0.013     .1505634    1.263772
pres_approve |   2.950238   1.818593     1.62   0.105     -.614139    6.514615
             |
        year |
       2013  |  -2.096949   .7755899    -2.70   0.007    -3.617077   -.5768203
       2014  |   .1478405   1.070112     0.14   0.890     -1.94954    2.245221
       2015  |   3.045693   1.302343     2.34   0.019     .4931473    5.598239
       2016  |   2.455044   1.557661     1.58   0.115    -.5979145    5.508003
             |
       _cons |   -14.1542   8.102372    -1.75   0.081    -30.03456    1.726156
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.6626266   .7795603    -0.85   0.395    -2.190537    .8652834
          3  |   .9316423   .6327113     1.47   0.141     -.308449    2.171734
          4  |    -.31555   .6196128    -0.51   0.611    -1.529969    .8988689
             |
FARC_actions |   .5864596   .3373573     1.74   0.082    -.0747485    1.247668
pres_approve |  -1.531998   1.463405    -1.05   0.295    -4.400219    1.336223
             |
        year |
       2013  |  -1.348947   1.045774    -1.29   0.197    -3.398626    .7007326
       2014  |   .6294811   1.129454     0.56   0.577    -1.584208     2.84317
       2015  |   1.419163     1.4955     0.95   0.343    -1.511962    4.350289
       2016  |   2.020566     1.6957     1.19   0.233    -1.302944    5.344076
             |
       _cons |   3.215619   6.735421     0.48   0.633    -9.985563     16.4168
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
end of do-file

. smhsiao
varlist required
r(100);

. smhsiao , elim(1)
varlist required
r(100);

. smhsiao, elim(3)
varlist required
r(100);

. smhsiao, elim(3) sampvar(side)
varlist required
r(100);

. smhsiao state_y , elim(3)

Iteration 0:   log likelihood = -451.86347

Multinomial logistic regression                   Number of obs   =        351
                                                  LR chi2(0)      =       0.00
                                                  Prob > chi2     =          .
Log likelihood = -451.86347                       Pseudo R2       =     0.0000

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
       _cons |  -1.236012   .1732414    -7.13   0.000    -1.575559   -.8964653
-------------+----------------------------------------------------------------
2            |
       _cons |   -.822825   .1487998    -5.53   0.000    -1.114467   -.5311828
-------------+----------------------------------------------------------------
3            |
       _cons |  -.4433354   .1314651    -3.37   0.001    -.7010022   -.1856685
------------------------------------------------------------------------------
(state_y==4 is the base outcome)

Small-Hsiao Test of IIA
-----------------------

  LnL for weighted average of coeffients in two half-samples: -1.3e+02
  LnL based on restricted model (state_y==3 omitted):         -1.3e+02
  Test chi2(1) =  1.226, Pr = 0.2682

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD07650.000000"

. mlogit state_y i.state_x FARC_actions pres_approve i.year

Iteration 0:   log likelihood = -421.28337  
Iteration 1:   log likelihood = -337.81502  
Iteration 2:   log likelihood = -334.25793  
Iteration 3:   log likelihood = -334.10685  
Iteration 4:   log likelihood = -334.10593  
Iteration 5:   log likelihood = -334.10593  

Multinomial logistic regression                 Number of obs     =        334
                                                LR chi2(27)       =     174.35
                                                Prob > chi2       =     0.0000
Log likelihood = -334.10593                     Pseudo R2         =     0.2069

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   -.808817   .6190229    -1.31   0.191    -2.022079    .4044456
          3  |   -3.21843   1.131565    -2.84   0.004    -5.436257   -1.000603
          4  |   -1.60129   .5557819    -2.88   0.004    -2.690603   -.5119774
             |
FARC_actions |   .4254625   .3171159     1.34   0.180    -.1960731    1.046998
pres_approve |   2.185481   2.016262     1.08   0.278    -1.766321    6.137283
             |
        year |
       2013  |  -1.798422   .8842566    -2.03   0.042    -3.531533   -.0653109
       2014  |   .3816552   1.189664     0.32   0.748    -1.950043    2.713354
       2015  |   1.846004   1.409303     1.31   0.190    -.9161797    4.608187
       2016  |   1.848568    1.68671     1.10   0.273    -1.457323    5.154458
             |
       _cons |  -10.17706   8.907175    -1.14   0.253    -27.63481    7.280677
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.6594005   .5834575    -1.13   0.258    -1.802956    .4841552
          3  |  -1.002562   .6107251    -1.64   0.101    -2.199561    .1944372
          4  |  -1.708308   .5446288    -3.14   0.002    -2.775761   -.6408556
             |
FARC_actions |   .7071676   .2839869     2.49   0.013     .1505634    1.263772
pres_approve |   2.950238   1.818593     1.62   0.105     -.614139    6.514615
             |
        year |
       2013  |  -2.096949   .7755899    -2.70   0.007    -3.617077   -.5768203
       2014  |   .1478405   1.070112     0.14   0.890     -1.94954    2.245221
       2015  |   3.045693   1.302343     2.34   0.019     .4931473    5.598239
       2016  |   2.455044   1.557661     1.58   0.115    -.5979145    5.508003
             |
       _cons |   -14.1542   8.102372    -1.75   0.081    -30.03456    1.726156
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.6626266   .7795603    -0.85   0.395    -2.190537    .8652834
          3  |   .9316423   .6327113     1.47   0.141     -.308449    2.171734
          4  |    -.31555   .6196128    -0.51   0.611    -1.529969    .8988689
             |
FARC_actions |   .5864596   .3373573     1.74   0.082    -.0747485    1.247668
pres_approve |  -1.531998   1.463405    -1.05   0.295    -4.400219    1.336223
             |
        year |
       2013  |  -1.348947   1.045774    -1.29   0.197    -3.398626    .7007326
       2014  |   .6294811   1.129454     0.56   0.577    -1.584208     2.84317
       2015  |   1.419163     1.4955     0.95   0.343    -1.511962    4.350289
       2016  |   2.020566     1.6957     1.19   0.233    -1.302944    5.344076
             |
       _cons |   3.215619   6.735421     0.48   0.633    -9.985563     16.4168
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
end of do-file

. mlogtest, iia base

**** Hausman tests of IIA assumption (N=334)

 Ho: Odds(Outcome-J vs Outcome-K) are independent of other alternatives.
factor variables and time-series operators not allowed
r(101);

. mlogtest

. mlogtest, lr

**** Likelihood-ratio tests for independent variables (N=334)

 Ho: All coefficients associated with given variable(s) are 0.

             |       chi2   df   P>chi2
-------------+-------------------------
factor variables and time-series operators not allowed
r(101);

. xi i.year
i.year            _Iyear_2012-2016    (naturally coded; _Iyear_2012 omitted)

. mlogit state_y i.state_x army_casualties pres_approve *_Iy
variable *_Iy not found
r(111);

. 
. mlogit state_y i.state_x army_casualties pres_approve _Iy*

Iteration 0:   log likelihood = -438.16878  
Iteration 1:   log likelihood = -354.63682  
Iteration 2:   log likelihood = -351.55903  
Iteration 3:   log likelihood = -351.44305  
Iteration 4:   log likelihood = -351.44227  
Iteration 5:   log likelihood = -351.44227  

Multinomial logistic regression                 Number of obs     =        343
                                                LR chi2(27)       =     173.45
                                                Prob > chi2       =     0.0000
Log likelihood = -351.44227                     Pseudo R2         =     0.1979

---------------------------------------------------------------------------------
        state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1               |
        state_x |
             2  |  -.3051091   .5851146    -0.52   0.602    -1.451913    .8416944
             3  |  -3.169758   1.128488    -2.81   0.005    -5.381554   -.9579616
             4  |  -1.587557   .5511261    -2.88   0.004    -2.667744   -.5073699
                |
army_casualties |   .4695831   .4455113     1.05   0.292     -.403603    1.342769
   pres_approve |  -.1837427    1.80422    -0.10   0.919    -3.719949    3.352464
    _Iyear_2013 |  -1.252856   .7107025    -1.76   0.078    -2.645808     .140095
    _Iyear_2014 |  -.3306384    1.13441    -0.29   0.771    -2.554042    1.892765
    _Iyear_2015 |   .0696715   1.094851     0.06   0.949    -2.076198    2.215541
    _Iyear_2016 |  -.2895994   1.207006    -0.24   0.810    -2.655288    2.076089
          _cons |  -.1966736   7.899564    -0.02   0.980    -15.67953    15.28619
----------------+----------------------------------------------------------------
2               |
        state_x |
             2  |  -.3012678   .5276862    -0.57   0.568    -1.335514    .7329782
             3  |  -1.200494   .5803588    -2.07   0.039    -2.337976   -.0630115
             4  |  -1.988546   .5122538    -3.88   0.000    -2.992545   -.9845469
                |
army_casualties |   .3083634   .3706998     0.83   0.405    -.4181949    1.034922
   pres_approve |  -.0451272   1.530679    -0.03   0.976    -3.045202    2.954948
    _Iyear_2013 |  -1.176017   .6092866    -1.93   0.054    -2.370197     .018163
    _Iyear_2014 |  -.6932542   .9818719    -0.71   0.480    -2.617688    1.231179
    _Iyear_2015 |   .2408189   .9287213     0.26   0.795    -1.579441    2.061079
    _Iyear_2016 |   -1.17332   1.039094    -1.13   0.259    -3.209908     .863267
          _cons |    .309217   6.653624     0.05   0.963    -12.73165    13.35008
----------------+----------------------------------------------------------------
3               |
        state_x |
             2  |  -.5411191   .7666036    -0.71   0.480    -2.043635    .9613963
             3  |    .977945   .6293273     1.55   0.120    -.2555139    2.211404
             4  |  -.3115991   .6166573    -0.51   0.613    -1.520225    .8970269
                |
army_casualties |  -.0450598   .4220756    -0.11   0.915    -.8723129    .7821932
   pres_approve |  -2.704252   1.386164    -1.95   0.051    -5.421083    .0125786
    _Iyear_2013 |  -.2788529   .9205919    -0.30   0.762     -2.08318    1.525474
    _Iyear_2014 |   .8028468   1.119942     0.72   0.473    -1.392198    2.997892
    _Iyear_2015 |  -.2285757     1.1858    -0.19   0.847    -2.552702     2.09555
    _Iyear_2016 |  -.3500365   1.072506    -0.33   0.744     -2.45211    1.752037
          _cons |   10.18304   6.200195     1.64   0.101    -1.969122     22.3352
----------------+----------------------------------------------------------------
4               |  (base outcome)
---------------------------------------------------------------------------------

. 
. mlogit state_y i.state_x army_casualties pres_approve i.year

Iteration 0:   log likelihood = -438.16878  
Iteration 1:   log likelihood = -354.63682  
Iteration 2:   log likelihood = -351.55903  
Iteration 3:   log likelihood = -351.44305  
Iteration 4:   log likelihood = -351.44227  
Iteration 5:   log likelihood = -351.44227  

Multinomial logistic regression                 Number of obs     =        343
                                                LR chi2(27)       =     173.45
                                                Prob > chi2       =     0.0000
Log likelihood = -351.44227                     Pseudo R2         =     0.1979

---------------------------------------------------------------------------------
        state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1               |
        state_x |
             2  |  -.3051091   .5851146    -0.52   0.602    -1.451913    .8416944
             3  |  -3.169758   1.128488    -2.81   0.005    -5.381554   -.9579616
             4  |  -1.587557   .5511261    -2.88   0.004    -2.667744   -.5073699
                |
army_casualties |   .4695831   .4455113     1.05   0.292     -.403603    1.342769
   pres_approve |  -.1837427    1.80422    -0.10   0.919    -3.719949    3.352464
                |
           year |
          2013  |  -1.252856   .7107025    -1.76   0.078    -2.645808     .140095
          2014  |  -.3306384    1.13441    -0.29   0.771    -2.554042    1.892765
          2015  |   .0696715   1.094851     0.06   0.949    -2.076198    2.215541
          2016  |  -.2895994   1.207006    -0.24   0.810    -2.655288    2.076089
                |
          _cons |  -.1966736   7.899564    -0.02   0.980    -15.67953    15.28619
----------------+----------------------------------------------------------------
2               |
        state_x |
             2  |  -.3012678   .5276862    -0.57   0.568    -1.335514    .7329782
             3  |  -1.200494   .5803588    -2.07   0.039    -2.337976   -.0630115
             4  |  -1.988546   .5122538    -3.88   0.000    -2.992545   -.9845469
                |
army_casualties |   .3083634   .3706998     0.83   0.405    -.4181949    1.034922
   pres_approve |  -.0451272   1.530679    -0.03   0.976    -3.045202    2.954948
                |
           year |
          2013  |  -1.176017   .6092866    -1.93   0.054    -2.370197     .018163
          2014  |  -.6932542   .9818719    -0.71   0.480    -2.617688    1.231179
          2015  |   .2408189   .9287213     0.26   0.795    -1.579441    2.061079
          2016  |   -1.17332   1.039094    -1.13   0.259    -3.209908     .863267
                |
          _cons |    .309217   6.653624     0.05   0.963    -12.73165    13.35008
----------------+----------------------------------------------------------------
3               |
        state_x |
             2  |  -.5411191   .7666036    -0.71   0.480    -2.043635    .9613963
             3  |    .977945   .6293273     1.55   0.120    -.2555139    2.211404
             4  |  -.3115991   .6166573    -0.51   0.613    -1.520225    .8970269
                |
army_casualties |  -.0450598   .4220756    -0.11   0.915    -.8723129    .7821932
   pres_approve |  -2.704252   1.386164    -1.95   0.051    -5.421083    .0125786
                |
           year |
          2013  |  -.2788529   .9205919    -0.30   0.762     -2.08318    1.525474
          2014  |   .8028468   1.119942     0.72   0.473    -1.392198    2.997892
          2015  |  -.2285757     1.1858    -0.19   0.847    -2.552702     2.09555
          2016  |  -.3500365   1.072506    -0.33   0.744     -2.45211    1.752037
                |
          _cons |   10.18304   6.200195     1.64   0.101    -1.969122     22.3352
----------------+----------------------------------------------------------------
4               |  (base outcome)
---------------------------------------------------------------------------------

. 
. mlogit state_y i.state_x army_casualties pres_approve _Iy*

Iteration 0:   log likelihood = -438.16878  
Iteration 1:   log likelihood = -354.63682  
Iteration 2:   log likelihood = -351.55903  
Iteration 3:   log likelihood = -351.44305  
Iteration 4:   log likelihood = -351.44227  
Iteration 5:   log likelihood = -351.44227  

Multinomial logistic regression                 Number of obs     =        343
                                                LR chi2(27)       =     173.45
                                                Prob > chi2       =     0.0000
Log likelihood = -351.44227                     Pseudo R2         =     0.1979

---------------------------------------------------------------------------------
        state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1               |
        state_x |
             2  |  -.3051091   .5851146    -0.52   0.602    -1.451913    .8416944
             3  |  -3.169758   1.128488    -2.81   0.005    -5.381554   -.9579616
             4  |  -1.587557   .5511261    -2.88   0.004    -2.667744   -.5073699
                |
army_casualties |   .4695831   .4455113     1.05   0.292     -.403603    1.342769
   pres_approve |  -.1837427    1.80422    -0.10   0.919    -3.719949    3.352464
    _Iyear_2013 |  -1.252856   .7107025    -1.76   0.078    -2.645808     .140095
    _Iyear_2014 |  -.3306384    1.13441    -0.29   0.771    -2.554042    1.892765
    _Iyear_2015 |   .0696715   1.094851     0.06   0.949    -2.076198    2.215541
    _Iyear_2016 |  -.2895994   1.207006    -0.24   0.810    -2.655288    2.076089
          _cons |  -.1966736   7.899564    -0.02   0.980    -15.67953    15.28619
----------------+----------------------------------------------------------------
2               |
        state_x |
             2  |  -.3012678   .5276862    -0.57   0.568    -1.335514    .7329782
             3  |  -1.200494   .5803588    -2.07   0.039    -2.337976   -.0630115
             4  |  -1.988546   .5122538    -3.88   0.000    -2.992545   -.9845469
                |
army_casualties |   .3083634   .3706998     0.83   0.405    -.4181949    1.034922
   pres_approve |  -.0451272   1.530679    -0.03   0.976    -3.045202    2.954948
    _Iyear_2013 |  -1.176017   .6092866    -1.93   0.054    -2.370197     .018163
    _Iyear_2014 |  -.6932542   .9818719    -0.71   0.480    -2.617688    1.231179
    _Iyear_2015 |   .2408189   .9287213     0.26   0.795    -1.579441    2.061079
    _Iyear_2016 |   -1.17332   1.039094    -1.13   0.259    -3.209908     .863267
          _cons |    .309217   6.653624     0.05   0.963    -12.73165    13.35008
----------------+----------------------------------------------------------------
3               |
        state_x |
             2  |  -.5411191   .7666036    -0.71   0.480    -2.043635    .9613963
             3  |    .977945   .6293273     1.55   0.120    -.2555139    2.211404
             4  |  -.3115991   .6166573    -0.51   0.613    -1.520225    .8970269
                |
army_casualties |  -.0450598   .4220756    -0.11   0.915    -.8723129    .7821932
   pres_approve |  -2.704252   1.386164    -1.95   0.051    -5.421083    .0125786
    _Iyear_2013 |  -.2788529   .9205919    -0.30   0.762     -2.08318    1.525474
    _Iyear_2014 |   .8028468   1.119942     0.72   0.473    -1.392198    2.997892
    _Iyear_2015 |  -.2285757     1.1858    -0.19   0.847    -2.552702     2.09555
    _Iyear_2016 |  -.3500365   1.072506    -0.33   0.744     -2.45211    1.752037
          _cons |   10.18304   6.200195     1.64   0.101    -1.969122     22.3352
----------------+----------------------------------------------------------------
4               |  (base outcome)
---------------------------------------------------------------------------------

. mlogtest , smhsiao

**** Small-Hsiao tests of IIA assumption (N=343)

 Ho: Odds(Outcome-J vs Outcome-K) are independent of other alternatives.
factor variables and time-series operators not allowed
r(101);

. summarize state_y

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     state_y |        351    2.991453    1.048774          1          4

. xi i.state_x
i.state_x         _Istate_x_1-4       (naturally coded; _Istate_x_1 omitted)

. mlogit state_y _Is* army_casualties pres_approve _Iy*
variable _Iy* not found
r(111);

. xi i.state_x i.year
i.state_x         _Istate_x_1-4       (naturally coded; _Istate_x_1 omitted)
i.year            _Iyear_2012-2016    (naturally coded; _Iyear_2012 omitted)

. mlogit state_y _Is* army_casualties pres_approve _Iy*

Iteration 0:   log likelihood = -438.16878  
Iteration 1:   log likelihood = -354.63682  
Iteration 2:   log likelihood = -351.55903  
Iteration 3:   log likelihood = -351.44305  
Iteration 4:   log likelihood = -351.44227  
Iteration 5:   log likelihood = -351.44227  

Multinomial logistic regression                 Number of obs     =        343
                                                LR chi2(27)       =     173.45
                                                Prob > chi2       =     0.0000
Log likelihood = -351.44227                     Pseudo R2         =     0.1979

---------------------------------------------------------------------------------
        state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1               |
    _Istate_x_2 |  -.3051091   .5851146    -0.52   0.602    -1.451913    .8416944
    _Istate_x_3 |  -3.169758   1.128488    -2.81   0.005    -5.381554   -.9579616
    _Istate_x_4 |  -1.587557   .5511261    -2.88   0.004    -2.667744   -.5073699
army_casualties |   .4695831   .4455113     1.05   0.292     -.403603    1.342769
   pres_approve |  -.1837427    1.80422    -0.10   0.919    -3.719949    3.352464
    _Iyear_2013 |  -1.252856   .7107025    -1.76   0.078    -2.645808     .140095
    _Iyear_2014 |  -.3306384    1.13441    -0.29   0.771    -2.554042    1.892765
    _Iyear_2015 |   .0696715   1.094851     0.06   0.949    -2.076198    2.215541
    _Iyear_2016 |  -.2895994   1.207006    -0.24   0.810    -2.655288    2.076089
          _cons |  -.1966736   7.899564    -0.02   0.980    -15.67953    15.28619
----------------+----------------------------------------------------------------
2               |
    _Istate_x_2 |  -.3012678   .5276862    -0.57   0.568    -1.335514    .7329782
    _Istate_x_3 |  -1.200494   .5803588    -2.07   0.039    -2.337976   -.0630115
    _Istate_x_4 |  -1.988546   .5122538    -3.88   0.000    -2.992545   -.9845469
army_casualties |   .3083634   .3706998     0.83   0.405    -.4181949    1.034922
   pres_approve |  -.0451272   1.530679    -0.03   0.976    -3.045202    2.954948
    _Iyear_2013 |  -1.176017   .6092866    -1.93   0.054    -2.370197     .018163
    _Iyear_2014 |  -.6932542   .9818719    -0.71   0.480    -2.617688    1.231179
    _Iyear_2015 |   .2408189   .9287213     0.26   0.795    -1.579441    2.061079
    _Iyear_2016 |   -1.17332   1.039094    -1.13   0.259    -3.209908     .863267
          _cons |    .309217   6.653624     0.05   0.963    -12.73165    13.35008
----------------+----------------------------------------------------------------
3               |
    _Istate_x_2 |  -.5411191   .7666036    -0.71   0.480    -2.043635    .9613963
    _Istate_x_3 |    .977945   .6293273     1.55   0.120    -.2555139    2.211404
    _Istate_x_4 |  -.3115991   .6166573    -0.51   0.613    -1.520225    .8970269
army_casualties |  -.0450598   .4220756    -0.11   0.915    -.8723129    .7821932
   pres_approve |  -2.704252   1.386164    -1.95   0.051    -5.421083    .0125786
    _Iyear_2013 |  -.2788529   .9205919    -0.30   0.762     -2.08318    1.525474
    _Iyear_2014 |   .8028468   1.119942     0.72   0.473    -1.392198    2.997892
    _Iyear_2015 |  -.2285757     1.1858    -0.19   0.847    -2.552702     2.09555
    _Iyear_2016 |  -.3500365   1.072506    -0.33   0.744     -2.45211    1.752037
          _cons |   10.18304   6.200195     1.64   0.101    -1.969122     22.3352
----------------+----------------------------------------------------------------
4               |  (base outcome)
---------------------------------------------------------------------------------

. mlogtest , hausman

**** Hausman tests of IIA assumption (N=343)

 Ho: Odds(Outcome-J vs Outcome-K) are independent of other alternatives.

 Omitted |      chi2   df   P>chi2   evidence
---------+------------------------------------
       1 |     0.307   20    1.000   for Ho    
       2 |    -0.165   20     ---    ---       
       3 |     0.583   19    1.000   for Ho    
----------------------------------------------
 Note: If chi2<0, the estimated model does not
 meet asymptotic assumptions of the test.

. mlogtest , smhsiao

**** Small-Hsiao tests of IIA assumption (N=343)

 Ho: Odds(Outcome-J vs Outcome-K) are independent of other alternatives.

 Omitted |  lnL(full)  lnL(omit)    chi2   df   P>chi2   evidence
---------+---------------------------------------------------------
       1 |   -120.152   -112.230  15.844   20    0.726   for Ho    
       2 |   -128.024    -92.784  70.480   20    0.000   against Ho
       3 |   -134.900    -98.795  72.211   20    0.000   against Ho
-------------------------------------------------------------------

. mlogtest , hausman smhsiao iia

**** Hausman tests of IIA assumption (N=343)

 Ho: Odds(Outcome-J vs Outcome-K) are independent of other alternatives.

 Omitted |      chi2   df   P>chi2   evidence
---------+------------------------------------
       1 |     0.307   20    1.000   for Ho    
       2 |    -0.165   20     ---    ---       
       3 |     0.583   19    1.000   for Ho    
----------------------------------------------
 Note: If chi2<0, the estimated model does not
 meet asymptotic assumptions of the test.

**** suest-based Hausman tests of IIA assumption (N=343)

 Ho: Odds(Outcome-J vs Outcome-K) are independent of other alternatives.

 Omitted |      chi2   df   P>chi2   evidence
---------+------------------------------------
       1 |    10.573   20    0.957   for Ho    
       2 |    13.578   20    0.851   for Ho    
       3 |    11.044   20    0.945   for Ho    
----------------------------------------------

**** Small-Hsiao tests of IIA assumption (N=343)

 Ho: Odds(Outcome-J vs Outcome-K) are independent of other alternatives.

 Omitted |  lnL(full)  lnL(omit)    chi2   df   P>chi2   evidence
---------+---------------------------------------------------------
       1 |   -139.313   -127.645  23.337   20    0.273   for Ho    
       2 |   -144.333   -107.760  73.147   20    0.000   against Ho
       3 |   -133.967   -104.440  59.054   20    0.000   against Ho
-------------------------------------------------------------------

. mlogtest , hausman smhsiao iia base

**** Hausman tests of IIA assumption (N=343)

 Ho: Odds(Outcome-J vs Outcome-K) are independent of other alternatives.

 Omitted |      chi2   df   P>chi2   evidence
---------+------------------------------------
       1 |     0.307   20    1.000   for Ho    
       2 |    -0.165   20     ---    ---       
       3 |     0.583   19    1.000   for Ho    
       4 |     1.723   19    1.000   for Ho    
----------------------------------------------
 Note: If chi2<0, the estimated model does not
 meet asymptotic assumptions of the test.

**** suest-based Hausman tests of IIA assumption (N=343)

 Ho: Odds(Outcome-J vs Outcome-K) are independent of other alternatives.

 Omitted |      chi2   df   P>chi2   evidence
---------+------------------------------------
       1 |    10.573   20    0.957   for Ho    
       2 |    13.578   20    0.851   for Ho    
       3 |    11.044   20    0.945   for Ho    
       4 |    15.921   20    0.722   for Ho    
----------------------------------------------

**** Small-Hsiao tests of IIA assumption (N=343)

 Ho: Odds(Outcome-J vs Outcome-K) are independent of other alternatives.

 Omitted |  lnL(full)  lnL(omit)    chi2   df   P>chi2   evidence
---------+---------------------------------------------------------
       1 |   -129.948   -121.249  17.398   20    0.627   for Ho    
       2 |   -136.518   -107.869  57.299   20    0.000   against Ho
       3 |   -128.541    -95.931  65.221   20    0.000   against Ho
       4 |   -109.407    -73.199  72.414   20    0.000   against Ho
-------------------------------------------------------------------

. 
. mlogtest, lr

**** Likelihood-ratio tests for independent variables (N=343)

 Ho: All coefficients associated with given variable(s) are 0.

             |       chi2   df   P>chi2
-------------+-------------------------
 _Istate_x_2 |      0.640    3    0.887
 _Istate_x_3 |     26.921    3    0.000
 _Istate_x_4 |     19.430    3    0.000
army_casua~s |      1.573    3    0.666
pres_approve |      4.821    3    0.185
 _Iyear_2013 |      5.012    3    0.171
 _Iyear_2014 |      1.585    3    0.663
 _Iyear_2015 |      0.152    3    0.985
 _Iyear_2016 |      1.296    3    0.730
---------------------------------------

. tab state_y state_x

           |                   state_x
   state_y |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         1 |        13         15          1         14 |        43 
         2 |        15         24         11         15 |        65 
         3 |         5          6         57         27 |        95 
         4 |        10         20         26         92 |       148 
-----------+--------------------------------------------+----------
     Total |        43         65         95        148 |       351 


. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD07650.000000"

. mlogit state_y i.state_x FARC_actions pres_approve i.year, robust

Iteration 0:   log pseudolikelihood = -421.28337  
Iteration 1:   log pseudolikelihood = -337.81502  
Iteration 2:   log pseudolikelihood = -334.25793  
Iteration 3:   log pseudolikelihood = -334.10685  
Iteration 4:   log pseudolikelihood = -334.10593  
Iteration 5:   log pseudolikelihood = -334.10593  

Multinomial logistic regression                 Number of obs     =        334
                                                Wald chi2(27)     =     158.65
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -334.10593               Pseudo R2         =     0.2069

------------------------------------------------------------------------------
             |               Robust
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   -.808817   .6030385    -1.34   0.180    -1.990751    .3731168
          3  |   -3.21843   1.113878    -2.89   0.004    -5.401591   -1.035269
          4  |   -1.60129   .5645571    -2.84   0.005    -2.707801   -.4947784
             |
FARC_actions |   .4254625    .286573     1.48   0.138    -.1362103    .9871353
pres_approve |   2.185481   2.070362     1.06   0.291    -1.872354    6.243316
             |
        year |
       2013  |  -1.798422    .761519    -2.36   0.018    -3.290972   -.3058721
       2014  |   .3816552   1.164807     0.33   0.743    -1.901324    2.664634
       2015  |   1.846004   1.408089     1.31   0.190    -.9137991    4.605807
       2016  |   1.848568   1.593946     1.16   0.246    -1.275509    4.972645
             |
       _cons |  -10.17706   9.206018    -1.11   0.269    -28.22053    7.866399
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.6594005   .5710048    -1.15   0.248    -1.778549    .4597484
          3  |  -1.002562    .640203    -1.57   0.117    -2.257337    .2522129
          4  |  -1.708308   .5596564    -3.05   0.002    -2.805215    -.611402
             |
FARC_actions |   .7071676   .2516056     2.81   0.005     .2140296    1.200305
pres_approve |   2.950238   1.850635     1.59   0.111    -.6769392    6.577415
             |
        year |
       2013  |  -2.096949   .7303178    -2.87   0.004    -3.528345   -.6655521
       2014  |   .1478405   1.132901     0.13   0.896    -2.072606    2.368286
       2015  |   3.045693   1.236507     2.46   0.014     .6221848    5.469202
       2016  |   2.455044   1.404103     1.75   0.080     -.296947    5.207035
             |
       _cons |   -14.1542   8.253523    -1.71   0.086    -30.33081    2.022407
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.6626266   .7832734    -0.85   0.398    -2.197814    .8725609
          3  |   .9316423   .6048879     1.54   0.124    -.2539161    2.117201
          4  |    -.31555   .5946579    -0.53   0.596    -1.481058    .8499581
             |
FARC_actions |   .5864596   .3105327     1.89   0.059    -.0221733    1.195093
pres_approve |  -1.531998   1.215966    -1.26   0.208    -3.915248    .8512524
             |
        year |
       2013  |  -1.348947   .9030154    -1.49   0.135    -3.118824    .4209311
       2014  |   .6294811   1.095991     0.57   0.566    -1.518622    2.777584
       2015  |   1.419163   1.510778     0.94   0.348    -1.541906    4.380233
       2016  |   2.020566   1.759083     1.15   0.251    -1.427172    5.468305
             |
       _cons |   3.215619   5.634923     0.57   0.568    -7.828626    14.25986
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
end of do-file

