----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lesliehuang/Dropbox/MA-thesis-analysis/MA_mnl.log
  log type:  text
 opened on:  26 Aug 2016, 15:48:04

. 
. * import data from R: already cleaned and transformed
. use mnl_data.dta
(Written by R.              )

. 
. * convert dates to stata format
. gen statadate = date - td(01jan1960)

. format statadate %td

. 
. * tsset statadate, daily
. 
. * create an ID var
. gen ID = _n

. 
. * need to make some factors
. describe year

              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------
year            str4    %4s                   year

. destring year, replace
year has all characters numeric; replaced as int

. 
. * MNL Model #1
. mlogit state_y i.state_x FARC_actions pres_approve i.year, robust

Iteration 0:   log pseudolikelihood = -421.28337  
Iteration 1:   log pseudolikelihood = -337.81502  
Iteration 2:   log pseudolikelihood = -334.25793  
Iteration 3:   log pseudolikelihood = -334.10685  
Iteration 4:   log pseudolikelihood = -334.10593  
Iteration 5:   log pseudolikelihood = -334.10593  

Multinomial logistic regression                 Number of obs     =        334
                                                Wald chi2(27)     =     158.65
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -334.10593               Pseudo R2         =     0.2069

------------------------------------------------------------------------------
             |               Robust
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   -.808817   .6030385    -1.34   0.180    -1.990751    .3731168
          3  |   -3.21843   1.113878    -2.89   0.004    -5.401591   -1.035269
          4  |   -1.60129   .5645571    -2.84   0.005    -2.707801   -.4947784
             |
FARC_actions |   .4254625    .286573     1.48   0.138    -.1362103    .9871353
pres_approve |   2.185481   2.070362     1.06   0.291    -1.872354    6.243316
             |
        year |
       2013  |  -1.798422    .761519    -2.36   0.018    -3.290972   -.3058721
       2014  |   .3816552   1.164807     0.33   0.743    -1.901324    2.664634
       2015  |   1.846004   1.408089     1.31   0.190    -.9137991    4.605807
       2016  |   1.848568   1.593946     1.16   0.246    -1.275509    4.972645
             |
       _cons |  -10.17706   9.206018    -1.11   0.269    -28.22053    7.866399
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.6594005   .5710048    -1.15   0.248    -1.778549    .4597484
          3  |  -1.002562    .640203    -1.57   0.117    -2.257337    .2522129
          4  |  -1.708308   .5596564    -3.05   0.002    -2.805215    -.611402
             |
FARC_actions |   .7071676   .2516056     2.81   0.005     .2140296    1.200305
pres_approve |   2.950238   1.850635     1.59   0.111    -.6769392    6.577415
             |
        year |
       2013  |  -2.096949   .7303178    -2.87   0.004    -3.528345   -.6655521
       2014  |   .1478405   1.132901     0.13   0.896    -2.072606    2.368286
       2015  |   3.045693   1.236507     2.46   0.014     .6221848    5.469202
       2016  |   2.455044   1.404103     1.75   0.080     -.296947    5.207035
             |
       _cons |   -14.1542   8.253523    -1.71   0.086    -30.33081    2.022407
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.6626266   .7832734    -0.85   0.398    -2.197814    .8725609
          3  |   .9316423   .6048879     1.54   0.124    -.2539161    2.117201
          4  |    -.31555   .5946579    -0.53   0.596    -1.481058    .8499581
             |
FARC_actions |   .5864596   .3105327     1.89   0.059    -.0221733    1.195093
pres_approve |  -1.531998   1.215966    -1.26   0.208    -3.915248    .8512524
             |
        year |
       2013  |  -1.348947   .9030154    -1.49   0.135    -3.118824    .4209311
       2014  |   .6294811   1.095991     0.57   0.566    -1.518622    2.777584
       2015  |   1.419163   1.510778     0.94   0.348    -1.541906    4.380233
       2016  |   2.020566   1.759083     1.15   0.251    -1.427172    5.468305
             |
       _cons |   3.215619   5.634923     0.57   0.568    -7.828626    14.25986
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
. mlogit, rrr

Multinomial logistic regression                 Number of obs     =        334
                                                Wald chi2(27)     =     158.65
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -334.10593               Pseudo R2         =     0.2069

------------------------------------------------------------------------------
             |               Robust
     state_y |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   .4453847   .2685841    -1.34   0.180     .1365928    1.452254
          3  |   .0400178    .044575    -2.89   0.004     .0045094    .3551309
          4  |   .2016363   .1138352    -2.84   0.005     .0666833     .609706
             |
FARC_actions |   1.530298   .4385421     1.48   0.138     .8726591    2.683536
pres_approve |   8.894926   18.41572     1.06   0.291     .1537613     514.562
             |
        year |
       2013  |   .1655599    .126077    -2.36   0.018     .0372177    .7364808
       2014  |   1.464707     1.7061     0.33   0.743     .1493708    14.36269
       2015  |   6.334456   8.919475     1.31   0.190     .4009979    100.0637
       2016  |   6.350717    10.1227     1.16   0.246     .2792887    144.4083
             |
       _cons |    .000038   .0003501    -1.11   0.269     5.55e-13    2608.158
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |   .5171613   .2953016    -1.15   0.248      .168883    1.583675
          3  |   .3669381   .2349149    -1.57   0.117     .1046288     1.28687
          4  |    .181172   .1013941    -3.05   0.002     .0604938    .5425896
             |
FARC_actions |   2.028238   .5103161     2.81   0.005     1.238659    3.321131
pres_approve |    19.1105   35.36656     1.59   0.111       .50817    718.6793
             |
        year |
       2013  |   .1228307   .0897054    -2.87   0.004     .0293534    .5139897
       2014  |   1.159328   1.313404     0.13   0.896     .1258574    10.67908
       2015  |    21.0246   25.99706     2.46   0.014     1.862994    237.2707
       2016  |   11.64695   16.35351     1.75   0.080     .7430834     182.552
             |
       _cons |   7.13e-07   5.88e-06    -1.71   0.086     6.72e-14    7.556491
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |   .5154955   .4037739    -0.85   0.398     .1110456    2.393031
          3  |   2.538675   1.535614     1.54   0.124     .7757569    8.307849
          4  |   .7293876   .4337361    -0.53   0.596      .227397    2.339549
             |
FARC_actions |   1.797613   .5582176     1.89   0.059     .9780707    3.303863
pres_approve |   .2161035   .2627746    -1.26   0.208     .0199356    2.342579
             |
        year |
       2013  |   .2595135   .2343447    -1.49   0.135     .0442091    1.523379
       2014  |   1.876637   2.056777     0.57   0.566     .2190134    16.08013
       2015  |   4.133661   6.245043     0.94   0.348     .2139728    79.85667
       2016  |   7.542594   13.26805     1.15   0.251     .2399866    237.0579
             |
       _cons |   24.91872   140.4151     0.57   0.568     .0003982     1559483
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
end of do-file

. fitstat

Measures of Fit for mlogit of state_y

Log-Lik Intercept Only:       -421.283   Log-Lik Full Model:           -334.106
D(304):                        668.212   LR(27):                        174.355
                                         Prob > LR:                       0.000
McFadden's R2:                   0.207   McFadden's Adj R2:               0.136
ML (Cox-Snell) R2:               0.407   Cragg-Uhler(Nagelkerke) R2:      0.442
Count R2:                        0.581   Adj Count R2:                    0.251
AIC:                             2.180   AIC*n:                         728.212
BIC:                         -1098.375   BIC':                          -17.454
BIC used by Stata:             842.546   AIC used by Stata:             728.212

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. mlogit state_y i.state_x FARC_actions pres_approve i.year

Iteration 0:   log likelihood = -421.28337  
Iteration 1:   log likelihood = -337.81502  
Iteration 2:   log likelihood = -334.25793  
Iteration 3:   log likelihood = -334.10685  
Iteration 4:   log likelihood = -334.10593  
Iteration 5:   log likelihood = -334.10593  

Multinomial logistic regression                 Number of obs     =        334
                                                LR chi2(27)       =     174.35
                                                Prob > chi2       =     0.0000
Log likelihood = -334.10593                     Pseudo R2         =     0.2069

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   -.808817   .6190229    -1.31   0.191    -2.022079    .4044456
          3  |   -3.21843   1.131565    -2.84   0.004    -5.436257   -1.000603
          4  |   -1.60129   .5557819    -2.88   0.004    -2.690603   -.5119774
             |
FARC_actions |   .4254625   .3171159     1.34   0.180    -.1960731    1.046998
pres_approve |   2.185481   2.016262     1.08   0.278    -1.766321    6.137283
             |
        year |
       2013  |  -1.798422   .8842566    -2.03   0.042    -3.531533   -.0653109
       2014  |   .3816552   1.189664     0.32   0.748    -1.950043    2.713354
       2015  |   1.846004   1.409303     1.31   0.190    -.9161797    4.608187
       2016  |   1.848568    1.68671     1.10   0.273    -1.457323    5.154458
             |
       _cons |  -10.17706   8.907175    -1.14   0.253    -27.63481    7.280677
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.6594005   .5834575    -1.13   0.258    -1.802956    .4841552
          3  |  -1.002562   .6107251    -1.64   0.101    -2.199561    .1944372
          4  |  -1.708308   .5446288    -3.14   0.002    -2.775761   -.6408556
             |
FARC_actions |   .7071676   .2839869     2.49   0.013     .1505634    1.263772
pres_approve |   2.950238   1.818593     1.62   0.105     -.614139    6.514615
             |
        year |
       2013  |  -2.096949   .7755899    -2.70   0.007    -3.617077   -.5768203
       2014  |   .1478405   1.070112     0.14   0.890     -1.94954    2.245221
       2015  |   3.045693   1.302343     2.34   0.019     .4931473    5.598239
       2016  |   2.455044   1.557661     1.58   0.115    -.5979145    5.508003
             |
       _cons |   -14.1542   8.102372    -1.75   0.081    -30.03456    1.726156
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.6626266   .7795603    -0.85   0.395    -2.190537    .8652834
          3  |   .9316423   .6327113     1.47   0.141     -.308449    2.171734
          4  |    -.31555   .6196128    -0.51   0.611    -1.529969    .8988689
             |
FARC_actions |   .5864596   .3373573     1.74   0.082    -.0747485    1.247668
pres_approve |  -1.531998   1.463405    -1.05   0.295    -4.400219    1.336223
             |
        year |
       2013  |  -1.348947   1.045774    -1.29   0.197    -3.398626    .7007326
       2014  |   .6294811   1.129454     0.56   0.577    -1.584208     2.84317
       2015  |   1.419163     1.4955     0.95   0.343    -1.511962    4.350289
       2016  |   2.020566     1.6957     1.19   0.233    -1.302944    5.344076
             |
       _cons |   3.215619   6.735421     0.48   0.633    -9.985563     16.4168
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
. mlogit, rrr

Multinomial logistic regression                 Number of obs     =        334
                                                LR chi2(27)       =     174.35
                                                Prob > chi2       =     0.0000
Log likelihood = -334.10593                     Pseudo R2         =     0.2069

------------------------------------------------------------------------------
     state_y |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   .4453847   .2757033    -1.31   0.191     .1323799    1.498471
          3  |   .0400178   .0452828    -2.84   0.004     .0043558    .3676578
          4  |   .2016363   .1120658    -2.88   0.004     .0678401    .5993093
             |
FARC_actions |   1.530298   .4852818     1.34   0.180     .8219521    2.849086
pres_approve |   8.894926    17.9345     1.08   0.278     .1709608    462.7943
             |
        year |
       2013  |   .1655599   .1463975    -2.03   0.042       .02926    .9367761
       2014  |   1.464707   1.742509     0.32   0.748     .1422679    15.07977
       2015  |   6.334456   8.927169     1.31   0.190     .4000444    100.3022
       2016  |   6.350717   10.71181     1.10   0.273     .2328589    173.2019
             |
       _cons |    .000038   .0003388    -1.14   0.253     9.96e-13    1451.971
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |   .5171613   .3017416    -1.13   0.258      .164811    1.622803
          3  |   .3669381   .2240983    -1.64   0.101     .1108518    1.214627
          4  |    .181172   .0986715    -3.14   0.002      .062302    .5268415
             |
FARC_actions |   2.028238   .5759931     2.49   0.013     1.162489    3.538743
pres_approve |    19.1105   34.75423     1.62   0.105     .5411066    674.9341
             |
        year |
       2013  |   .1228307   .0952662    -2.70   0.007     .0268611    .5616815
       2014  |   1.159328   1.240611     0.14   0.890     .1423395    9.442506
       2015  |    21.0246   27.38125     2.34   0.019     1.637462    269.9506
       2016  |   11.64695   18.14199     1.58   0.115     .5499574     246.658
             |
       _cons |   7.13e-07   5.77e-06    -1.75   0.081     9.04e-14    5.619011
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |   .5154955   .4018598    -0.85   0.395     .1118567    2.375679
          3  |   2.538675   1.606248     1.47   0.141     .7345854    8.773481
          4  |   .7293876   .4519379    -0.51   0.611     .2165424    2.456823
             |
FARC_actions |   1.797613   .6064378     1.74   0.082     .9279768    3.482212
pres_approve |   .2161035   .3162469    -1.05   0.295     .0122747    3.804645
             |
        year |
       2013  |   .2595135   .2713924    -1.29   0.197     .0334192    2.015229
       2014  |   1.876637   2.119575     0.56   0.577     .2051101    17.17012
       2015  |   4.133661   6.181889     0.95   0.343      .220477    77.50086
       2016  |   7.542594   12.78997     1.19   0.233     .2717307    209.3644
             |
       _cons |   24.91872   167.8381     0.48   0.633     .0000461    1.35e+07
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
. fitstat

Measures of Fit for mlogit of state_y

Log-Lik Intercept Only:       -421.283   Log-Lik Full Model:           -334.106
D(304):                        668.212   LR(27):                        174.355
                                         Prob > LR:                       0.000
McFadden's R2:                   0.207   McFadden's Adj R2:               0.136
ML (Cox-Snell) R2:               0.407   Cragg-Uhler(Nagelkerke) R2:      0.442
Count R2:                        0.581   Adj Count R2:                    0.251
AIC:                             2.180   AIC*n:                         728.212
BIC:                         -1098.375   BIC':                          -17.454
BIC used by Stata:             842.546   AIC used by Stata:             728.212

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. mlogit state_y i.state_x 

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -392.14145  
Iteration 2:   log likelihood = -388.73013  
Iteration 3:   log likelihood = -388.57574  
Iteration 4:   log likelihood = -388.57414  
Iteration 5:   log likelihood = -388.57414  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(9)        =     126.58
                                                Prob > chi2       =     0.0000
Log likelihood = -388.57414                     Pseudo R2         =     0.1401

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |  -.5500463   .5418392    -1.02   0.310    -1.612032     .511939
          3  |   -3.52046   1.102444    -3.19   0.001    -5.681211   -1.359709
          4  |  -2.145096   .5091377    -4.21   0.000    -3.142987   -1.147204
             |
       _cons |   .2623643   .4206222     0.62   0.533    -.5620402    1.086769
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.2231436    .508265    -0.44   0.661    -1.219325    .7730376
          3  |  -1.265666   .5440931    -2.33   0.020    -2.332069   -.1992635
          4  |  -2.219203   .4941689    -4.49   0.000    -3.187757    -1.25065
             |
       _cons |   .4054651   .4082483     0.99   0.321    -.3946868    1.205617
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.5108256   .7187953    -0.71   0.477    -1.919639    .8979873
          3  |   1.478102   .5966619     2.48   0.013     .3086661    2.647538
          4  |  -.5328045   .5898361    -0.90   0.366    -1.688862    .6232529
             |
       _cons |  -.6931472   .5477226    -1.27   0.206    -1.766664    .3803693
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
. fitstat

Measures of Fit for mlogit of state_y

Log-Lik Intercept Only:       -451.863   Log-Lik Full Model:           -388.574
D(339):                        777.148   LR(9):                         126.579
                                         Prob > LR:                       0.000
McFadden's R2:                   0.140   McFadden's Adj R2:               0.114
ML (Cox-Snell) R2:               0.303   Cragg-Uhler(Nagelkerke) R2:      0.328
Count R2:                        0.536   Adj Count R2:                    0.197
AIC:                             2.282   AIC*n:                         801.148
BIC:                         -1209.658   BIC':                          -73.832
BIC used by Stata:             847.478   AIC used by Stata:             801.148

. 
end of do-file

. tab state_x state_y

           |                   state_y
   state_x |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         1 |        13         15          5         10 |        43 
         2 |        15         24          6         20 |        65 
         3 |         1         11         57         26 |        95 
         4 |        14         15         27         92 |       148 
-----------+--------------------------------------------+----------
     Total |        43         65         95        148 |       351 


. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. mlogit state_y i.state_x 

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -392.14145  
Iteration 2:   log likelihood = -388.73013  
Iteration 3:   log likelihood = -388.57574  
Iteration 4:   log likelihood = -388.57414  
Iteration 5:   log likelihood = -388.57414  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(9)        =     126.58
                                                Prob > chi2       =     0.0000
Log likelihood = -388.57414                     Pseudo R2         =     0.1401

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |  -.5500463   .5418392    -1.02   0.310    -1.612032     .511939
          3  |   -3.52046   1.102444    -3.19   0.001    -5.681211   -1.359709
          4  |  -2.145096   .5091377    -4.21   0.000    -3.142987   -1.147204
             |
       _cons |   .2623643   .4206222     0.62   0.533    -.5620402    1.086769
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.2231436    .508265    -0.44   0.661    -1.219325    .7730376
          3  |  -1.265666   .5440931    -2.33   0.020    -2.332069   -.1992635
          4  |  -2.219203   .4941689    -4.49   0.000    -3.187757    -1.25065
             |
       _cons |   .4054651   .4082483     0.99   0.321    -.3946868    1.205617
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.5108256   .7187953    -0.71   0.477    -1.919639    .8979873
          3  |   1.478102   .5966619     2.48   0.013     .3086661    2.647538
          4  |  -.5328045   .5898361    -0.90   0.366    -1.688862    .6232529
             |
       _cons |  -.6931472   .5477226    -1.27   0.206    -1.766664    .3803693
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
. fitstat

Measures of Fit for mlogit of state_y

Log-Lik Intercept Only:       -451.863   Log-Lik Full Model:           -388.574
D(339):                        777.148   LR(9):                         126.579
                                         Prob > LR:                       0.000
McFadden's R2:                   0.140   McFadden's Adj R2:               0.114
ML (Cox-Snell) R2:               0.303   Cragg-Uhler(Nagelkerke) R2:      0.328
Count R2:                        0.536   Adj Count R2:                    0.197
AIC:                             2.282   AIC*n:                         801.148
BIC:                         -1209.658   BIC':                          -73.832
BIC used by Stata:             847.478   AIC used by Stata:             801.148

. 
end of do-file

. prvalue
factor variables and time-series operators not allowed
r(101);

. mlogit state_y state_x

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -424.78386  
Iteration 2:   log likelihood = -424.21878  
Iteration 3:   log likelihood = -424.21777  
Iteration 4:   log likelihood = -424.21777  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(3)        =      55.29
                                                Prob > chi2       =     0.0000
Log likelihood = -424.21777                     Pseudo R2         =     0.0612

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |   -.950815   .1772635    -5.36   0.000    -1.298245   -.6033849
       _cons |   1.520226    .514402     2.96   0.003     .5120166    2.528435
-------------+----------------------------------------------------------------
2            |
     state_x |  -.9269507   .1565639    -5.92   0.000     -1.23381   -.6200912
       _cons |   1.876472   .4684623     4.01   0.000     .9583029    2.794641
-------------+----------------------------------------------------------------
3            |
     state_x |  -.2800747   .1432443    -1.96   0.051    -.5608284    .0006791
       _cons |   .4636661   .4802168     0.97   0.334    -.4775415    1.404874
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. prvalue

mlogit: Predictions for state_y

Confidence intervals by delta method

                                95% Conf. Interval
  Pr(y=1|x):          0.1126   [ 0.0762,    0.1491]
  Pr(y=2|x):          0.1727   [ 0.1294,    0.2161]
  Pr(y=3|x):          0.2912   [ 0.2408,    0.3416]
  Pr(y=4|x):          0.4234   [ 0.3675,    0.4793]

     state_x
x=  2.991453

. predict
varlist required
r(100);

. predict state_y
variable state_y already defined
r(110);

. mlogit state_y i.state_x

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -392.14145  
Iteration 2:   log likelihood = -388.73013  
Iteration 3:   log likelihood = -388.57574  
Iteration 4:   log likelihood = -388.57414  
Iteration 5:   log likelihood = -388.57414  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(9)        =     126.58
                                                Prob > chi2       =     0.0000
Log likelihood = -388.57414                     Pseudo R2         =     0.1401

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |  -.5500463   .5418392    -1.02   0.310    -1.612032     .511939
          3  |   -3.52046   1.102444    -3.19   0.001    -5.681211   -1.359709
          4  |  -2.145096   .5091377    -4.21   0.000    -3.142987   -1.147204
             |
       _cons |   .2623643   .4206222     0.62   0.533    -.5620402    1.086769
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.2231436    .508265    -0.44   0.661    -1.219325    .7730376
          3  |  -1.265666   .5440931    -2.33   0.020    -2.332069   -.1992635
          4  |  -2.219203   .4941689    -4.49   0.000    -3.187757    -1.25065
             |
       _cons |   .4054651   .4082483     0.99   0.321    -.3946868    1.205617
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.5108256   .7187953    -0.71   0.477    -1.919639    .8979873
          3  |   1.478102   .5966619     2.48   0.013     .3086661    2.647538
          4  |  -.5328045   .5898361    -0.90   0.366    -1.688862    .6232529
             |
       _cons |  -.6931472   .5477226    -1.27   0.206    -1.766664    .3803693
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. prvalue
factor variables and time-series operators not allowed
r(101);

. mlogit state_y _Is*
variable _Is* not found
r(111);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. xi i.state_x i.year
i.state_x         _Istate_x_1-4       (naturally coded; _Istate_x_1 omitted)
i.year            _Iyear_2012-2016    (naturally coded; _Iyear_2012 omitted)

. 
end of do-file

. mlogit state_y _Is*

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -392.14145  
Iteration 2:   log likelihood = -388.73013  
Iteration 3:   log likelihood = -388.57574  
Iteration 4:   log likelihood = -388.57414  
Iteration 5:   log likelihood = -388.57414  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(9)        =     126.58
                                                Prob > chi2       =     0.0000
Log likelihood = -388.57414                     Pseudo R2         =     0.1401

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
 _Istate_x_2 |  -.5500463   .5418392    -1.02   0.310    -1.612032     .511939
 _Istate_x_3 |   -3.52046   1.102444    -3.19   0.001    -5.681211   -1.359709
 _Istate_x_4 |  -2.145096   .5091377    -4.21   0.000    -3.142987   -1.147204
       _cons |   .2623643   .4206222     0.62   0.533    -.5620402    1.086769
-------------+----------------------------------------------------------------
2            |
 _Istate_x_2 |  -.2231436    .508265    -0.44   0.661    -1.219325    .7730376
 _Istate_x_3 |  -1.265666   .5440931    -2.33   0.020    -2.332069   -.1992635
 _Istate_x_4 |  -2.219203   .4941689    -4.49   0.000    -3.187757    -1.25065
       _cons |   .4054651   .4082483     0.99   0.321    -.3946868    1.205617
-------------+----------------------------------------------------------------
3            |
 _Istate_x_2 |  -.5108256   .7187953    -0.71   0.477    -1.919639    .8979873
 _Istate_x_3 |   1.478102   .5966619     2.48   0.013     .3086661    2.647538
 _Istate_x_4 |  -.5328045   .5898361    -0.90   0.366    -1.688862    .6232529
       _cons |  -.6931472   .5477226    -1.27   0.206    -1.766664    .3803693
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. prvalue

mlogit: Predictions for state_y

Confidence intervals by delta method

                                95% Conf. Interval
  Pr(y=1|x):          0.0862   [ 0.0389,    0.1334]
  Pr(y=2|x):          0.1885   [ 0.1399,    0.2371]
  Pr(y=3|x):          0.2550   [ 0.1994,    0.3105]
  Pr(y=4|x):          0.4703   [ 0.4070,    0.5337]

    _Istate_x_2  _Istate_x_3  _Istate_x_4
x=    .18518519    .27065527    .42165242

. mlogit state_y state_x

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -424.78386  
Iteration 2:   log likelihood = -424.21878  
Iteration 3:   log likelihood = -424.21777  
Iteration 4:   log likelihood = -424.21777  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(3)        =      55.29
                                                Prob > chi2       =     0.0000
Log likelihood = -424.21777                     Pseudo R2         =     0.0612

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |   -.950815   .1772635    -5.36   0.000    -1.298245   -.6033849
       _cons |   1.520226    .514402     2.96   0.003     .5120166    2.528435
-------------+----------------------------------------------------------------
2            |
     state_x |  -.9269507   .1565639    -5.92   0.000     -1.23381   -.6200912
       _cons |   1.876472   .4684623     4.01   0.000     .9583029    2.794641
-------------+----------------------------------------------------------------
3            |
     state_x |  -.2800747   .1432443    -1.96   0.051    -.5608284    .0006791
       _cons |   .4636661   .4802168     0.97   0.334    -.4775415    1.404874
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. mlogit state_y i.state_x

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -392.14145  
Iteration 2:   log likelihood = -388.73013  
Iteration 3:   log likelihood = -388.57574  
Iteration 4:   log likelihood = -388.57414  
Iteration 5:   log likelihood = -388.57414  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(9)        =     126.58
                                                Prob > chi2       =     0.0000
Log likelihood = -388.57414                     Pseudo R2         =     0.1401

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |  -.5500463   .5418392    -1.02   0.310    -1.612032     .511939
          3  |   -3.52046   1.102444    -3.19   0.001    -5.681211   -1.359709
          4  |  -2.145096   .5091377    -4.21   0.000    -3.142987   -1.147204
             |
       _cons |   .2623643   .4206222     0.62   0.533    -.5620402    1.086769
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.2231436    .508265    -0.44   0.661    -1.219325    .7730376
          3  |  -1.265666   .5440931    -2.33   0.020    -2.332069   -.1992635
          4  |  -2.219203   .4941689    -4.49   0.000    -3.187757    -1.25065
             |
       _cons |   .4054651   .4082483     0.99   0.321    -.3946868    1.205617
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.5108256   .7187953    -0.71   0.477    -1.919639    .8979873
          3  |   1.478102   .5966619     2.48   0.013     .3086661    2.647538
          4  |  -.5328045   .5898361    -0.90   0.366    -1.688862    .6232529
             |
       _cons |  -.6931472   .5477226    -1.27   0.206    -1.766664    .3803693
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. listcoef i.statex, help
factor variables and time-series operators not allowed
r(101);

. mlogit state_y _Is*

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -392.14145  
Iteration 2:   log likelihood = -388.73013  
Iteration 3:   log likelihood = -388.57574  
Iteration 4:   log likelihood = -388.57414  
Iteration 5:   log likelihood = -388.57414  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(9)        =     126.58
                                                Prob > chi2       =     0.0000
Log likelihood = -388.57414                     Pseudo R2         =     0.1401

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
 _Istate_x_2 |  -.5500463   .5418392    -1.02   0.310    -1.612032     .511939
 _Istate_x_3 |   -3.52046   1.102444    -3.19   0.001    -5.681211   -1.359709
 _Istate_x_4 |  -2.145096   .5091377    -4.21   0.000    -3.142987   -1.147204
       _cons |   .2623643   .4206222     0.62   0.533    -.5620402    1.086769
-------------+----------------------------------------------------------------
2            |
 _Istate_x_2 |  -.2231436    .508265    -0.44   0.661    -1.219325    .7730376
 _Istate_x_3 |  -1.265666   .5440931    -2.33   0.020    -2.332069   -.1992635
 _Istate_x_4 |  -2.219203   .4941689    -4.49   0.000    -3.187757    -1.25065
       _cons |   .4054651   .4082483     0.99   0.321    -.3946868    1.205617
-------------+----------------------------------------------------------------
3            |
 _Istate_x_2 |  -.5108256   .7187953    -0.71   0.477    -1.919639    .8979873
 _Istate_x_3 |   1.478102   .5966619     2.48   0.013     .3086661    2.647538
 _Istate_x_4 |  -.5328045   .5898361    -0.90   0.366    -1.688862    .6232529
       _cons |  -.6931472   .5477226    -1.27   0.206    -1.766664    .3803693
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. listcoef _Is*

mlogit (N=351): Factor Change in the Odds of state_y 

Variable: _Istate_x_2 (sd=.38900225)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
1       -2        |  -0.32690   -0.651   0.515   0.7212   0.8806
1       -3        |  -0.03922   -0.055   0.956   0.9615   0.9849
1       -4        |  -0.55005   -1.015   0.310   0.5769   0.8074
2       -1        |   0.32690    0.651   0.515   1.3867   1.1356
2       -3        |   0.28768    0.417   0.676   1.3333   1.1184
2       -4        |  -0.22314   -0.439   0.661   0.8000   0.9169
3       -1        |   0.03922    0.055   0.956   1.0400   1.0154
3       -2        |  -0.28768   -0.417   0.676   0.7500   0.8941
3       -4        |  -0.51083   -0.711   0.477   0.6000   0.8198
4       -1        |   0.55005    1.015   0.310   1.7333   1.2386
4       -2        |   0.22314    0.439   0.661   1.2500   1.0907
4       -3        |   0.51083    0.711   0.477   1.6667   1.2198
----------------------------------------------------------------

Variable: _Istate_x_3 (sd=.44493258)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
1       -2        |  -2.25479   -2.029   0.042   0.1049   0.3667
1       -3        |  -4.99856   -4.393   0.000   0.0067   0.1082
1       -4        |  -3.52046   -3.193   0.001   0.0296   0.2088
2       -1        |   2.25479    2.029   0.042   9.5333   2.7271
2       -3        |  -2.74377   -4.480   0.000   0.0643   0.2950
2       -4        |  -1.26567   -2.326   0.020   0.2821   0.5694
3       -1        |   4.99856    4.393   0.000 148.1999   9.2444
3       -2        |   2.74377    4.480   0.000  15.5455   3.3899
3       -4        |   1.47810    2.477   0.013   4.3846   1.9303
4       -1        |   3.52046    3.193   0.001  33.8000   4.7892
4       -2        |   1.26567    2.326   0.020   3.5455   1.7562
4       -3        |  -1.47810   -2.477   0.013   0.2281   0.5181
----------------------------------------------------------------

Variable: _Istate_x_4 (sd=.49452847)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
1       -2        |   0.07411    0.140   0.889   1.0769   1.0373
1       -3        |  -1.61229   -2.597   0.009   0.1994   0.4505
1       -4        |  -2.14510   -4.213   0.000   0.1171   0.3462
2       -1        |  -0.07411   -0.140   0.889   0.9286   0.9640
2       -3        |  -1.68640   -2.771   0.006   0.1852   0.4343
2       -4        |  -2.21920   -4.491   0.000   0.1087   0.3337
3       -1        |   1.61229    2.597   0.009   5.0143   2.2196
3       -2        |   1.68640    2.771   0.006   5.4000   2.3024
3       -4        |  -0.53280   -0.903   0.366   0.5870   0.7684
4       -1        |   2.14510    4.213   0.000   8.5429   2.8887
4       -2        |   2.21920    4.491   0.000   9.2000   2.9965
4       -3        |   0.53280    0.903   0.366   1.7037   1.3015
----------------------------------------------------------------

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. 
. margins state_x, atmeans predict(outcome(1))
factor 'state_x' not found in list of covariates
r(322);

end of do-file

r(322);

. mlogit state_y i.state_x

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -392.14145  
Iteration 2:   log likelihood = -388.73013  
Iteration 3:   log likelihood = -388.57574  
Iteration 4:   log likelihood = -388.57414  
Iteration 5:   log likelihood = -388.57414  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(9)        =     126.58
                                                Prob > chi2       =     0.0000
Log likelihood = -388.57414                     Pseudo R2         =     0.1401

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |  -.5500463   .5418392    -1.02   0.310    -1.612032     .511939
          3  |   -3.52046   1.102444    -3.19   0.001    -5.681211   -1.359709
          4  |  -2.145096   .5091377    -4.21   0.000    -3.142987   -1.147204
             |
       _cons |   .2623643   .4206222     0.62   0.533    -.5620402    1.086769
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.2231436    .508265    -0.44   0.661    -1.219325    .7730376
          3  |  -1.265666   .5440931    -2.33   0.020    -2.332069   -.1992635
          4  |  -2.219203   .4941689    -4.49   0.000    -3.187757    -1.25065
             |
       _cons |   .4054651   .4082483     0.99   0.321    -.3946868    1.205617
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.5108256   .7187953    -0.71   0.477    -1.919639    .8979873
          3  |   1.478102   .5966619     2.48   0.013     .3086661    2.647538
          4  |  -.5328045   .5898361    -0.90   0.366    -1.688862    .6232529
             |
       _cons |  -.6931472   .5477226    -1.27   0.206    -1.766664    .3803693
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
. margins state_x, atmeans predict(outcome(1))

Adjusted predictions                            Number of obs     =        351
Model VCE    : OIM

Expression   : Pr(state_y==1), predict(outcome(1))
at           : 1.state_x       =    .1225071 (mean)
               2.state_x       =    .1851852 (mean)
               3.state_x       =    .2706553 (mean)
               4.state_x       =    .4216524 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     state_x |
          1  |   .3023256   .0700373     4.32   0.000     .1650549    .4395962
          2  |   .2307692   .0522589     4.42   0.000     .1283436    .3331949
          3  |   .0105263   .0104708     1.01   0.315     -.009996    .0310487
          4  |   .0945946    .024056     3.93   0.000     .0474457    .1417435
------------------------------------------------------------------------------

. marginsplot, name(state_x) 

  Variables that uniquely identify margins: state_x

. predict pm1 pm2 pm3
(option pr assumed; predicted probabilities)
too few variables specified
state_y has 4 outcomes and so you must specify 4 new variables, or you can use the outcome()
option and specify variables one at a time
r(102);

. predict pm1 pm2 pm3 pm4
(option pr assumed; predicted probabilities)

. dotplot pm1 pm2 pm3 pm4

. mlogit state_y i.state_
state_ ambiguous abbreviation
r(111);

. mlogit state_y i.state_x

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -392.14145  
Iteration 2:   log likelihood = -388.73013  
Iteration 3:   log likelihood = -388.57574  
Iteration 4:   log likelihood = -388.57414  
Iteration 5:   log likelihood = -388.57414  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(9)        =     126.58
                                                Prob > chi2       =     0.0000
Log likelihood = -388.57414                     Pseudo R2         =     0.1401

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |  -.5500463   .5418392    -1.02   0.310    -1.612032     .511939
          3  |   -3.52046   1.102444    -3.19   0.001    -5.681211   -1.359709
          4  |  -2.145096   .5091377    -4.21   0.000    -3.142987   -1.147204
             |
       _cons |   .2623643   .4206222     0.62   0.533    -.5620402    1.086769
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.2231436    .508265    -0.44   0.661    -1.219325    .7730376
          3  |  -1.265666   .5440931    -2.33   0.020    -2.332069   -.1992635
          4  |  -2.219203   .4941689    -4.49   0.000    -3.187757    -1.25065
             |
       _cons |   .4054651   .4082483     0.99   0.321    -.3946868    1.205617
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.5108256   .7187953    -0.71   0.477    -1.919639    .8979873
          3  |   1.478102   .5966619     2.48   0.013     .3086661    2.647538
          4  |  -.5328045   .5898361    -0.90   0.366    -1.688862    .6232529
             |
       _cons |  -.6931472   .5477226    -1.27   0.206    -1.766664    .3803693
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. rrr
command rrr is unrecognized
r(199);

. mlogit state_y i.state_x, rrr

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -392.14145  
Iteration 2:   log likelihood = -388.73013  
Iteration 3:   log likelihood = -388.57574  
Iteration 4:   log likelihood = -388.57414  
Iteration 5:   log likelihood = -388.57414  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(9)        =     126.58
                                                Prob > chi2       =     0.0000
Log likelihood = -388.57414                     Pseudo R2         =     0.1401

------------------------------------------------------------------------------
     state_y |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   .5769231   .3125996    -1.02   0.310     .1994819    1.668523
          3  |   .0295858   .0326167    -3.19   0.001     .0034094    .2567356
          4  |   .1170569   .0595981    -4.21   0.000     .0431537    .3175233
             |
       _cons |        1.3   .5468089     0.62   0.533     .5700449    2.964679
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |         .8    .406612    -0.44   0.661     .2954296    2.166337
          3  |   .2820513   .1534622    -2.33   0.020     .0970946     .819334
          4  |   .1086957    .053714    -4.49   0.000     .0412643    .2863186
             |
       _cons |        1.5   .6123724     0.99   0.321      .673891    3.338819
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |         .6   .4312772    -0.71   0.477       .14666    2.454658
          3  |   4.384615   2.616133     2.48   0.013     1.361608    14.11923
          4  |   .5869565   .3462081    -0.90   0.366     .1847296    1.864985
             |
       _cons |         .5   .2738613    -1.27   0.206     .1709022    1.462825
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. mlogit state_y i.state_x, or
option or not allowed
r(198);

. mlogit _Is* , or
option or not allowed
r(198);

. mlogit state_y i.state_x

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -392.14145  
Iteration 2:   log likelihood = -388.73013  
Iteration 3:   log likelihood = -388.57574  
Iteration 4:   log likelihood = -388.57414  
Iteration 5:   log likelihood = -388.57414  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(9)        =     126.58
                                                Prob > chi2       =     0.0000
Log likelihood = -388.57414                     Pseudo R2         =     0.1401

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |  -.5500463   .5418392    -1.02   0.310    -1.612032     .511939
          3  |   -3.52046   1.102444    -3.19   0.001    -5.681211   -1.359709
          4  |  -2.145096   .5091377    -4.21   0.000    -3.142987   -1.147204
             |
       _cons |   .2623643   .4206222     0.62   0.533    -.5620402    1.086769
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.2231436    .508265    -0.44   0.661    -1.219325    .7730376
          3  |  -1.265666   .5440931    -2.33   0.020    -2.332069   -.1992635
          4  |  -2.219203   .4941689    -4.49   0.000    -3.187757    -1.25065
             |
       _cons |   .4054651   .4082483     0.99   0.321    -.3946868    1.205617
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.5108256   .7187953    -0.71   0.477    -1.919639    .8979873
          3  |   1.478102   .5966619     2.48   0.013     .3086661    2.647538
          4  |  -.5328045   .5898361    -0.90   0.366    -1.688862    .6232529
             |
       _cons |  -.6931472   .5477226    -1.27   0.206    -1.766664    .3803693
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. listcoef

mlogit (N=351): Factor Change in the Odds of state_y 

Variable: 1b.state_x (sd=0)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
----------------------------------------------------------------

Variable: 2.state_x (sd=.38900225)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
1       -2        |  -0.32690   -0.651   0.515   0.7212   0.8806
1       -3        |  -0.03922   -0.055   0.956   0.9615   0.9849
1       -4        |  -0.55005   -1.015   0.310   0.5769   0.8074
2       -1        |   0.32690    0.651   0.515   1.3867   1.1356
2       -3        |   0.28768    0.417   0.676   1.3333   1.1184
2       -4        |  -0.22314   -0.439   0.661   0.8000   0.9169
3       -1        |   0.03922    0.055   0.956   1.0400   1.0154
3       -2        |  -0.28768   -0.417   0.676   0.7500   0.8941
3       -4        |  -0.51083   -0.711   0.477   0.6000   0.8198
4       -1        |   0.55005    1.015   0.310   1.7333   1.2386
4       -2        |   0.22314    0.439   0.661   1.2500   1.0907
4       -3        |   0.51083    0.711   0.477   1.6667   1.2198
----------------------------------------------------------------

Variable: 3.state_x (sd=.44493258)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
1       -2        |  -2.25479   -2.029   0.042   0.1049   0.3667
1       -3        |  -4.99856   -4.393   0.000   0.0067   0.1082
1       -4        |  -3.52046   -3.193   0.001   0.0296   0.2088
2       -1        |   2.25479    2.029   0.042   9.5333   2.7271
2       -3        |  -2.74377   -4.480   0.000   0.0643   0.2950
2       -4        |  -1.26567   -2.326   0.020   0.2821   0.5694
3       -1        |   4.99856    4.393   0.000 148.1999   9.2444
3       -2        |   2.74377    4.480   0.000  15.5455   3.3899
3       -4        |   1.47810    2.477   0.013   4.3846   1.9303
4       -1        |   3.52046    3.193   0.001  33.8000   4.7892
4       -2        |   1.26567    2.326   0.020   3.5455   1.7562
4       -3        |  -1.47810   -2.477   0.013   0.2281   0.5181
----------------------------------------------------------------

Variable: 4.state_x (sd=.49452847)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
1       -2        |   0.07411    0.140   0.889   1.0769   1.0373
1       -3        |  -1.61229   -2.597   0.009   0.1994   0.4505
1       -4        |  -2.14510   -4.213   0.000   0.1171   0.3462
2       -1        |  -0.07411   -0.140   0.889   0.9286   0.9640
2       -3        |  -1.68640   -2.771   0.006   0.1852   0.4343
2       -4        |  -2.21920   -4.491   0.000   0.1087   0.3337
3       -1        |   1.61229    2.597   0.009   5.0143   2.2196
3       -2        |   1.68640    2.771   0.006   5.4000   2.3024
3       -4        |  -0.53280   -0.903   0.366   0.5870   0.7684
4       -1        |   2.14510    4.213   0.000   8.5429   2.8887
4       -2        |   2.21920    4.491   0.000   9.2000   2.9965
4       -3        |   0.53280    0.903   0.366   1.7037   1.3015
----------------------------------------------------------------

. mlogplot state_y i.state_x
factor variables and time-series operators not allowed
r(101);

. mlogplot state_y _Is*
factor variables and time-series operators not allowed
r(101);

. prgen i.state_x
factor variables and time-series operators not allowed
r(101);

. prgen _Is*
too many variables specified
r(103);

. prgen _Istate_x_2
option generate() required
r(198);

. prgen _Istate_x_2, gen(m)
factor variables and time-series operators not allowed
r(101);

. tab state_y state_x

           |                   state_x
   state_y |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         1 |        13         15          1         14 |        43 
         2 |        15         24         11         15 |        65 
         3 |         5          6         57         27 |        95 
         4 |        10         20         26         92 |       148 
-----------+--------------------------------------------+----------
     Total |        43         65         95        148 |       351 


. tab state_x state_y

           |                   state_y
   state_x |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         1 |        13         15          5         10 |        43 
         2 |        15         24          6         20 |        65 
         3 |         1         11         57         26 |        95 
         4 |        14         15         27         92 |       148 
-----------+--------------------------------------------+----------
     Total |        43         65         95        148 |       351 


. mlogit state_y i.state_x

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -392.14145  
Iteration 2:   log likelihood = -388.73013  
Iteration 3:   log likelihood = -388.57574  
Iteration 4:   log likelihood = -388.57414  
Iteration 5:   log likelihood = -388.57414  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(9)        =     126.58
                                                Prob > chi2       =     0.0000
Log likelihood = -388.57414                     Pseudo R2         =     0.1401

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |  -.5500463   .5418392    -1.02   0.310    -1.612032     .511939
          3  |   -3.52046   1.102444    -3.19   0.001    -5.681211   -1.359709
          4  |  -2.145096   .5091377    -4.21   0.000    -3.142987   -1.147204
             |
       _cons |   .2623643   .4206222     0.62   0.533    -.5620402    1.086769
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.2231436    .508265    -0.44   0.661    -1.219325    .7730376
          3  |  -1.265666   .5440931    -2.33   0.020    -2.332069   -.1992635
          4  |  -2.219203   .4941689    -4.49   0.000    -3.187757    -1.25065
             |
       _cons |   .4054651   .4082483     0.99   0.321    -.3946868    1.205617
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.5108256   .7187953    -0.71   0.477    -1.919639    .8979873
          3  |   1.478102   .5966619     2.48   0.013     .3086661    2.647538
          4  |  -.5328045   .5898361    -0.90   0.366    -1.688862    .6232529
             |
       _cons |  -.6931472   .5477226    -1.27   0.206    -1.766664    .3803693
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. listcoef, factor

mlogit (N=351): Factor Change in the Odds of state_y 

Variable: 1b.state_x (sd=0)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
----------------------------------------------------------------

Variable: 2.state_x (sd=.38900225)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
1       -2        |  -0.32690   -0.651   0.515   0.7212   0.8806
1       -3        |  -0.03922   -0.055   0.956   0.9615   0.9849
1       -4        |  -0.55005   -1.015   0.310   0.5769   0.8074
2       -1        |   0.32690    0.651   0.515   1.3867   1.1356
2       -3        |   0.28768    0.417   0.676   1.3333   1.1184
2       -4        |  -0.22314   -0.439   0.661   0.8000   0.9169
3       -1        |   0.03922    0.055   0.956   1.0400   1.0154
3       -2        |  -0.28768   -0.417   0.676   0.7500   0.8941
3       -4        |  -0.51083   -0.711   0.477   0.6000   0.8198
4       -1        |   0.55005    1.015   0.310   1.7333   1.2386
4       -2        |   0.22314    0.439   0.661   1.2500   1.0907
4       -3        |   0.51083    0.711   0.477   1.6667   1.2198
----------------------------------------------------------------

Variable: 3.state_x (sd=.44493258)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
1       -2        |  -2.25479   -2.029   0.042   0.1049   0.3667
1       -3        |  -4.99856   -4.393   0.000   0.0067   0.1082
1       -4        |  -3.52046   -3.193   0.001   0.0296   0.2088
2       -1        |   2.25479    2.029   0.042   9.5333   2.7271
2       -3        |  -2.74377   -4.480   0.000   0.0643   0.2950
2       -4        |  -1.26567   -2.326   0.020   0.2821   0.5694
3       -1        |   4.99856    4.393   0.000 148.1999   9.2444
3       -2        |   2.74377    4.480   0.000  15.5455   3.3899
3       -4        |   1.47810    2.477   0.013   4.3846   1.9303
4       -1        |   3.52046    3.193   0.001  33.8000   4.7892
4       -2        |   1.26567    2.326   0.020   3.5455   1.7562
4       -3        |  -1.47810   -2.477   0.013   0.2281   0.5181
----------------------------------------------------------------

Variable: 4.state_x (sd=.49452847)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
1       -2        |   0.07411    0.140   0.889   1.0769   1.0373
1       -3        |  -1.61229   -2.597   0.009   0.1994   0.4505
1       -4        |  -2.14510   -4.213   0.000   0.1171   0.3462
2       -1        |  -0.07411   -0.140   0.889   0.9286   0.9640
2       -3        |  -1.68640   -2.771   0.006   0.1852   0.4343
2       -4        |  -2.21920   -4.491   0.000   0.1087   0.3337
3       -1        |   1.61229    2.597   0.009   5.0143   2.2196
3       -2        |   1.68640    2.771   0.006   5.4000   2.3024
3       -4        |  -0.53280   -0.903   0.366   0.5870   0.7684
4       -1        |   2.14510    4.213   0.000   8.5429   2.8887
4       -2        |   2.21920    4.491   0.000   9.2000   2.9965
4       -3        |   0.53280    0.903   0.366   1.7037   1.3015
----------------------------------------------------------------

. listcoef, std
option std not allowed after mlogit
r(198);

. prtab state_y i.state_x
factor variables and time-series operators not allowed
r(101);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. mlogit state_y i.state_x 

Iteration 0:   log likelihood = -451.86347  
Iteration 1:   log likelihood = -392.14145  
Iteration 2:   log likelihood = -388.73013  
Iteration 3:   log likelihood = -388.57574  
Iteration 4:   log likelihood = -388.57414  
Iteration 5:   log likelihood = -388.57414  

Multinomial logistic regression                 Number of obs     =        351
                                                LR chi2(9)        =     126.58
                                                Prob > chi2       =     0.0000
Log likelihood = -388.57414                     Pseudo R2         =     0.1401

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |  -.5500463   .5418392    -1.02   0.310    -1.612032     .511939
          3  |   -3.52046   1.102444    -3.19   0.001    -5.681211   -1.359709
          4  |  -2.145096   .5091377    -4.21   0.000    -3.142987   -1.147204
             |
       _cons |   .2623643   .4206222     0.62   0.533    -.5620402    1.086769
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.2231436    .508265    -0.44   0.661    -1.219325    .7730376
          3  |  -1.265666   .5440931    -2.33   0.020    -2.332069   -.1992635
          4  |  -2.219203   .4941689    -4.49   0.000    -3.187757    -1.25065
             |
       _cons |   .4054651   .4082483     0.99   0.321    -.3946868    1.205617
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.5108256   .7187953    -0.71   0.477    -1.919639    .8979873
          3  |   1.478102   .5966619     2.48   0.013     .3086661    2.647538
          4  |  -.5328045   .5898361    -0.90   0.366    -1.688862    .6232529
             |
       _cons |  -.6931472   .5477226    -1.27   0.206    -1.766664    .3803693
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. redict(outcome(1))
command redict is unrecognized
r(199);

end of do-file

r(199);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. margins state_x, atmeans predict(outcome(1))

Adjusted predictions                            Number of obs     =        351
Model VCE    : OIM

Expression   : Pr(state_y==1), predict(outcome(1))
at           : 1.state_x       =    .1225071 (mean)
               2.state_x       =    .1851852 (mean)
               3.state_x       =    .2706553 (mean)
               4.state_x       =    .4216524 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     state_x |
          1  |   .3023256   .0700373     4.32   0.000     .1650549    .4395962
          2  |   .2307692   .0522589     4.42   0.000     .1283436    .3331949
          3  |   .0105263   .0104708     1.01   0.315     -.009996    .0310487
          4  |   .0945946    .024056     3.93   0.000     .0474457    .1417435
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. marginsplot, name(state_x) 

  Variables that uniquely identify margins: state_x
graph state_x already exists
r(110);

end of do-file

r(110);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. graph combine state_x state_x2 state_x3 state_x4, ycommon
state_x2 is not a memory graph
r(198);

end of do-file

r(198);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. margins state_x, atmeans predict(outcome(2))

Adjusted predictions                            Number of obs     =        351
Model VCE    : OIM

Expression   : Pr(state_y==2), predict(outcome(2))
at           : 1.state_x       =    .1225071 (mean)
               2.state_x       =    .1851852 (mean)
               3.state_x       =    .2706553 (mean)
               4.state_x       =    .4216524 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     state_x |
          1  |   .3488372   .0726812     4.80   0.000     .2063847    .4912897
          2  |   .3692308   .0598587     6.17   0.000     .2519098    .4865517
          3  |   .1157895   .0328285     3.53   0.000     .0514469    .1801321
          4  |   .1013514   .0248073     4.09   0.000       .05273    .1499727
------------------------------------------------------------------------------

. marginsplot, name(state_x2) 

  Variables that uniquely identify margins: state_x

. margins state_x, atmeans predict(outcome(3))

Adjusted predictions                            Number of obs     =        351
Model VCE    : OIM

Expression   : Pr(state_y==3), predict(outcome(3))
at           : 1.state_x       =    .1225071 (mean)
               2.state_x       =    .1851852 (mean)
               3.state_x       =    .2706553 (mean)
               4.state_x       =    .4216524 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     state_x |
          1  |   .1162791   .0488848     2.38   0.017     .0204666    .2120916
          2  |   .0923077   .0359031     2.57   0.010      .021939    .1626764
          3  |         .6   .0502625    11.94   0.000     .5014874    .6985126
          4  |   .1824324   .0317455     5.75   0.000     .1202124    .2446524
------------------------------------------------------------------------------

. marginsplot, name(state_x3) 

  Variables that uniquely identify margins: state_x

. margins state_x, atmeans predict(outcome(4))

Adjusted predictions                            Number of obs     =        351
Model VCE    : OIM

Expression   : Pr(state_y==4), predict(outcome(4))
at           : 1.state_x       =    .1225071 (mean)
               2.state_x       =    .1851852 (mean)
               3.state_x       =    .2706553 (mean)
               4.state_x       =    .4216524 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     state_x |
          1  |   .2325581    .064425     3.61   0.000     .1062875    .3588288
          2  |   .3076923   .0572468     5.37   0.000     .1954906     .419894
          3  |   .2736842   .0457431     5.98   0.000     .1840293    .3633391
          4  |   .6216216   .0398653    15.59   0.000      .543487    .6997562
------------------------------------------------------------------------------

. marginsplot, name(state_x4) 

  Variables that uniquely identify margins: state_x

. graph combine state_x state_x2 state_x3 state_x4, ycommon

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. margins state_x, atmeans predict(outcome(1))

Adjusted predictions                            Number of obs     =        351
Model VCE    : OIM

Expression   : Pr(state_y==1), predict(outcome(1))
at           : 1.state_x       =    .1225071 (mean)
               2.state_x       =    .1851852 (mean)
               3.state_x       =    .2706553 (mean)
               4.state_x       =    .4216524 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     state_x |
          1  |   .3023256   .0700373     4.32   0.000     .1650549    .4395962
          2  |   .2307692   .0522589     4.42   0.000     .1283436    .3331949
          3  |   .0105263   .0104708     1.01   0.315     -.009996    .0310487
          4  |   .0945946    .024056     3.93   0.000     .0474457    .1417435
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. margins state_x, atmeans predict(outcome(2))

Adjusted predictions                            Number of obs     =        351
Model VCE    : OIM

Expression   : Pr(state_y==2), predict(outcome(2))
at           : 1.state_x       =    .1225071 (mean)
               2.state_x       =    .1851852 (mean)
               3.state_x       =    .2706553 (mean)
               4.state_x       =    .4216524 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     state_x |
          1  |   .3488372   .0726812     4.80   0.000     .2063847    .4912897
          2  |   .3692308   .0598587     6.17   0.000     .2519098    .4865517
          3  |   .1157895   .0328285     3.53   0.000     .0514469    .1801321
          4  |   .1013514   .0248073     4.09   0.000       .05273    .1499727
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. margins state_x, atmeans predict(outcome(3))

Adjusted predictions                            Number of obs     =        351
Model VCE    : OIM

Expression   : Pr(state_y==3), predict(outcome(3))
at           : 1.state_x       =    .1225071 (mean)
               2.state_x       =    .1851852 (mean)
               3.state_x       =    .2706553 (mean)
               4.state_x       =    .4216524 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     state_x |
          1  |   .1162791   .0488848     2.38   0.017     .0204666    .2120916
          2  |   .0923077   .0359031     2.57   0.010      .021939    .1626764
          3  |         .6   .0502625    11.94   0.000     .5014874    .6985126
          4  |   .1824324   .0317455     5.75   0.000     .1202124    .2446524
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08866.000000"

. margins state_x, atmeans predict(outcome(4))

Adjusted predictions                            Number of obs     =        351
Model VCE    : OIM

Expression   : Pr(state_y==4), predict(outcome(4))
at           : 1.state_x       =    .1225071 (mean)
               2.state_x       =    .1851852 (mean)
               3.state_x       =    .2706553 (mean)
               4.state_x       =    .4216524 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     state_x |
          1  |   .2325581    .064425     3.61   0.000     .1062875    .3588288
          2  |   .3076923   .0572468     5.37   0.000     .1954906     .419894
          3  |   .2736842   .0457431     5.98   0.000     .1840293    .3633391
          4  |   .6216216   .0398653    15.59   0.000      .543487    .6997562
------------------------------------------------------------------------------

. 
end of do-file

