---------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lesliehuang/Dropbox/MA-thesis-analysis/MA_mnl.log
  log type:  text
 opened on:  24 Aug 2016, 22:45:48

. 
. * import data from R: already cleaned and transformed
. use mnl_data.dta
(Written by R.              )

. 
. * convert dates to stata format
. gen statadate = date - td(01jan1960)

. format statadate %td

. 
. * tsset statadate, daily
. 
. * need to make some factors
. describe year

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------
year            str4    %4s                   year

. destring year, replace
year has all characters numeric; replaced as int

. 
. * MNL Model #1
. mlogit state_y i.state_x FARC_actions pres_approve i.year

Iteration 0:   log likelihood = -421.28337  
Iteration 1:   log likelihood = -337.81502  
Iteration 2:   log likelihood = -334.25793  
Iteration 3:   log likelihood = -334.10685  
Iteration 4:   log likelihood = -334.10593  
Iteration 5:   log likelihood = -334.10593  

Multinomial logistic regression                 Number of obs     =        334
                                                LR chi2(27)       =     174.35
                                                Prob > chi2       =     0.0000
Log likelihood = -334.10593                     Pseudo R2         =     0.2069

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   -.808817   .6190229    -1.31   0.191    -2.022079    .4044456
          3  |   -3.21843   1.131565    -2.84   0.004    -5.436257   -1.000603
          4  |   -1.60129   .5557819    -2.88   0.004    -2.690603   -.5119774
             |
FARC_actions |   .4254625   .3171159     1.34   0.180    -.1960731    1.046998
pres_approve |   2.185481   2.016262     1.08   0.278    -1.766321    6.137283
             |
        year |
       2013  |  -1.798422   .8842566    -2.03   0.042    -3.531533   -.0653109
       2014  |   .3816552   1.189664     0.32   0.748    -1.950043    2.713354
       2015  |   1.846004   1.409303     1.31   0.190    -.9161797    4.608187
       2016  |   1.848568    1.68671     1.10   0.273    -1.457323    5.154458
             |
       _cons |  -10.17706   8.907175    -1.14   0.253    -27.63481    7.280677
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -.6594005   .5834575    -1.13   0.258    -1.802956    .4841552
          3  |  -1.002562   .6107251    -1.64   0.101    -2.199561    .1944372
          4  |  -1.708308   .5446288    -3.14   0.002    -2.775761   -.6408556
             |
FARC_actions |   .7071676   .2839869     2.49   0.013     .1505634    1.263772
pres_approve |   2.950238   1.818593     1.62   0.105     -.614139    6.514615
             |
        year |
       2013  |  -2.096949   .7755899    -2.70   0.007    -3.617077   -.5768203
       2014  |   .1478405   1.070112     0.14   0.890     -1.94954    2.245221
       2015  |   3.045693   1.302343     2.34   0.019     .4931473    5.598239
       2016  |   2.455044   1.557661     1.58   0.115    -.5979145    5.508003
             |
       _cons |   -14.1542   8.102372    -1.75   0.081    -30.03456    1.726156
-------------+----------------------------------------------------------------
3            |
     state_x |
          2  |  -.6626266   .7795603    -0.85   0.395    -2.190537    .8652834
          3  |   .9316423   .6327113     1.47   0.141     -.308449    2.171734
          4  |    -.31555   .6196128    -0.51   0.611    -1.529969    .8988689
             |
FARC_actions |   .5864596   .3373573     1.74   0.082    -.0747485    1.247668
pres_approve |  -1.531998   1.463405    -1.05   0.295    -4.400219    1.336223
             |
        year |
       2013  |  -1.348947   1.045774    -1.29   0.197    -3.398626    .7007326
       2014  |   .6294811   1.129454     0.56   0.577    -1.584208     2.84317
       2015  |   1.419163     1.4955     0.95   0.343    -1.511962    4.350289
       2016  |   2.020566     1.6957     1.19   0.233    -1.302944    5.344076
             |
       _cons |   3.215619   6.735421     0.48   0.633    -9.985563     16.4168
-------------+----------------------------------------------------------------
4            |  (base outcome)
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD07650.000000"

. 
. margins state_x, atmeans predict(outcome(1))

Adjusted predictions                            Number of obs     =        334
Model VCE    : OIM

Expression   : Pr(state_y==1), predict(outcome(1))
at           : 1.state_x       =    .1137725 (mean)
               2.state_x       =    .1676647 (mean)
               3.state_x       =    .2754491 (mean)
               4.state_x       =    .4431138 (mean)
               FARC_actions    =    3.761786 (mean)
               pres_approve    =    3.997687 (mean)
               2012.year       =    .1047904 (mean)
               2013.year       =    .4101796 (mean)
               2014.year       =     .242515 (mean)
               2015.year       =    .0988024 (mean)
               2016.year       =    .1437126 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     state_x |
          1  |   .2668177   .0773859     3.45   0.001     .1151441    .4184914
          2  |   .1882025   .0590483     3.19   0.001       .07247     .303935
          3  |   .0140176   .0140073     1.00   0.317    -.0134363    .0414714
          4  |   .1096326   .0293022     3.74   0.000     .0522013    .1670639
------------------------------------------------------------------------------

. 
end of do-file

. cor sentiment_level year
(obs=352)

             | sentim~l     year
-------------+------------------
sentiment_~l |   1.0000
        year |  -0.1799   1.0000


. reg sentiment_level year

      Source |       SS           df       MS      Number of obs   =       352
-------------+----------------------------------   F(1, 350)       =     11.70
       Model |  2.72140529         1  2.72140529   Prob > F        =    0.0007
    Residual |  81.3893902       350  .232541115   R-squared       =    0.0324
-------------+----------------------------------   Adj R-squared   =    0.0296
       Total |  84.1107955       351  .239631896   Root MSE        =    .48223

------------------------------------------------------------------------------
sentiment_~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |  -.0727527   .0212668    -3.42   0.001    -.1145795   -.0309259
       _cons |   147.1131   42.82671     3.44   0.001     62.88305    231.3432
------------------------------------------------------------------------------

. cor sentiment_level i.year
factor variables not allowed
r(101);

. tab sentiment_level year

sentiment_ |                          year
     level |      2012       2013       2014       2015       2016 |     Total
-----------+-------------------------------------------------------+----------
         0 |        11         33         58         12         25 |       139 
         1 |        24        113         27         21         28 |       213 
-----------+-------------------------------------------------------+----------
     Total |        35        146         85         33         53 |       352 


