----------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lesliehuang/Dropbox/MA-thesis-analysis/MA_mnl.log
  log type:  text
 opened on:   1 Sep 2016, 14:04:22

. 
. set seed 1234

. 
. * import data from R: already cleaned and transformed
. use mnl_data.dta
(Written by R.              )

. 
. * convert dates to stata format
. gen statadate = date - td(01jan1960)

. format statadate %td

. 
. * tsset statadate, daily
. 
. * create an ID var
. gen ID = _n

. 
. * need to make some factors
. describe year

              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------
year            long    %9.0g      year       year

. destring year, replace
year already numeric; no replace

. 
. * MNL Model #1
. quietly {

. * outreg2 using mnl_table, se bfmt(fc) bdec(3) tdec(3) bracket drop(year*) label title("Multinomial Logi
> t Model Results") eform tex replace
. estimates store ll1

. * get AIC and BIC
. fitstat

Measures of Fit for mlogit of state_y

Log-Lik Intercept Only:       -459.728   Log-Lik Full Model:           -400.968
D(406):                        801.937   LR(9):                         117.520
                                         Prob > LR:                       0.000
McFadden's R2:                   0.128   McFadden's Adj R2:               0.102
ML (Cox-Snell) R2:               0.245   Cragg-Uhler(Nagelkerke) R2:      0.276
Count R2:                        0.600   Adj Count R2:                    0.139
AIC:                             1.976   AIC*n:                         825.937
BIC:                         -1648.469   BIC':                          -63.201
BIC used by Stata:             874.362   AIC used by Stata:             825.937

. 
. * get the conditional odds ratios' exponentiated coefficients (e^b) to calculate the Markov transition p
> robabilities
. listcoef

mlogit (N=418): Factor Change in the Odds of state_y 

Variable: 1b.state_x (sd=0)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
----------------------------------------------------------------

Variable: 2.state_x (sd=.40817099)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
1       -2        |  -1.54045   -1.918   0.055   0.2143   0.5332
1       -4        |  -2.77259   -2.264   0.024   0.0625   0.3225
1       -3        |  -3.10906   -2.551   0.011   0.0446   0.2811
2       -1        |   1.54045    1.918   0.055   4.6667   1.8753
2       -4        |  -1.23214   -1.104   0.270   0.2917   0.6048
2       -3        |  -1.56862   -1.414   0.157   0.2083   0.5272
4       -1        |   2.77259    2.264   0.024  16.0000   3.1009
4       -2        |   1.23214    1.104   0.270   3.4286   1.6536
4       -3        |  -0.33647   -0.233   0.816   0.7143   0.8717
3       -1        |   3.10906    2.551   0.011  22.4000   3.5574
3       -2        |   1.56862    1.414   0.157   4.8000   1.8970
3       -4        |   0.33647    0.233   0.816   1.4000   1.1472
----------------------------------------------------------------

Variable: 3.state_x (sd=.49930821)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
1       -2        |  -2.33537   -2.397   0.017   0.0968   0.3116
1       -4        |  -3.98898   -2.984   0.003   0.0185   0.1365
1       -3        |  -5.79301   -4.371   0.000   0.0030   0.0554
2       -1        |   2.33537    2.397   0.017  10.3333   3.2094
2       -4        |  -1.65361   -1.487   0.137   0.1914   0.4379
2       -3        |  -3.45764   -3.150   0.002   0.0315   0.1779
4       -1        |   3.98898    2.984   0.003  54.0000   7.3282
4       -2        |   1.65361    1.487   0.137   5.2258   2.2834
4       -3        |  -1.80403   -1.262   0.207   0.1646   0.4063
3       -1        |   5.79301    4.371   0.000 328.0000  18.0383
3       -2        |   3.45764    3.150   0.002  31.7419   5.6205
3       -4        |   1.80403    1.262   0.207   6.0741   2.4615
----------------------------------------------------------------

Variable: 4.state_x (sd=.41800383)

Odds comparing    |
Alternative 1     |
to Alternative 2  |      b         z     P>|z|     e^b   e^bStdX
------------------+---------------------------------------------
1       -2        |  -2.36712   -1.946   0.052   0.0938   0.3718
1       -4        |  -5.21494   -3.460   0.001   0.0054   0.1131
1       -3        |  -4.82028   -3.191   0.001   0.0081   0.1333
2       -1        |   2.36712    1.946   0.052  10.6667   2.6898
2       -4        |  -2.84781   -2.546   0.011   0.0580   0.3041
2       -3        |  -2.45316   -2.184   0.029   0.0860   0.3586
4       -1        |   5.21494    3.460   0.001 184.0000   8.8451
4       -2        |   2.84781    2.546   0.011  17.2500   3.2884
4       -3        |   0.39465    0.275   0.783   1.4839   1.1794
3       -1        |   4.82028    3.191   0.001 124.0000   7.4999
3       -2        |   2.45316    2.184   0.029  11.6250   2.7883
3       -4        |  -0.39465   -0.275   0.783   0.6739   0.8479
----------------------------------------------------------------

. 
. * Model # 2: ADD YEAR
. 
. mlogit state_y i.state_x i.year , baseoutcome(3)

Iteration 0:   log likelihood = -459.72829  
Iteration 1:   log likelihood = -415.69583  
Iteration 2:   log likelihood = -379.51144  (backed up)
Iteration 3:   log likelihood = -369.38923  
Iteration 4:   log likelihood =  -360.5363  
Iteration 5:   log likelihood = -358.93765  
Iteration 6:   log likelihood = -358.61395  
Iteration 7:   log likelihood = -358.53907  
Iteration 8:   log likelihood =  -358.5214  
Iteration 9:   log likelihood = -358.51752  
Iteration 10:  log likelihood = -358.51672  
Iteration 11:  log likelihood = -358.51654  
Iteration 12:  log likelihood =  -358.5165  
Iteration 13:  log likelihood = -358.51649  

Multinomial logistic regression                 Number of obs     =        418
                                                LR chi2(21)       =     202.42
                                                Prob > chi2       =     0.0000
Log likelihood = -358.51649                     Pseudo R2         =     0.2202

------------------------------------------------------------------------------
     state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |  -3.027353   1.234105    -2.45   0.014    -5.446154   -.6085512
          3  |  -5.481956    1.33928    -4.09   0.000    -8.106897   -2.857015
          4  |  -5.123265   1.568066    -3.27   0.001    -8.196617   -2.049913
             |
        year |
       2013  |     15.219   3340.818     0.00   0.996    -6532.665    6563.103
       2014  |   14.89234   3340.818     0.00   0.996    -6532.991    6562.776
       2015  |   14.05769   3340.818     0.00   0.997    -6533.826    6561.942
       2016  |    31.5903    3420.47     0.01   0.993    -6672.407    6735.588
             |
       _cons |  -13.77084   3340.818    -0.00   0.997    -6561.655    6534.113
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |  -1.882726   1.129206    -1.67   0.095    -4.095928    .3304772
          3  |  -3.281683   1.112916    -2.95   0.003    -5.462958   -1.100409
          4  |  -3.108742   1.156831    -2.69   0.007     -5.37609   -.8413943
             |
        year |
       2013  |  -1.921574   .6310286    -3.05   0.002    -3.158367   -.6847806
       2014  |  -2.462125   .6789217    -3.63   0.000    -3.792788   -1.131463
       2015  |  -2.265514   .6590412    -3.44   0.001    -3.557211   -.9738174
       2016  |    14.6735   733.8569     0.02   0.984     -1423.66    1453.007
             |
       _cons |   3.740364     1.2536     2.98   0.003     1.283354    6.197375
-------------+----------------------------------------------------------------
3            |  (base outcome)
-------------+----------------------------------------------------------------
4            |
     state_x |
          2  |  -.6442713   1.491146    -0.43   0.666    -3.566864    2.278321
          3  |  -1.443028   1.476406    -0.98   0.328     -4.33673    1.450674
          4  |  -.5967607   1.488636    -0.40   0.689    -3.514434    2.320912
             |
        year |
       2013  |  -1.848705   .6623399    -2.79   0.005    -3.146867   -.5505427
       2014  |  -2.732296   .7582863    -3.60   0.000     -4.21851   -1.246083
       2015  |  -1.714461   .6711551    -2.55   0.011    -3.029901   -.3990214
       2016  |   15.81468   733.8569     0.02   0.983    -1422.518    1454.148
             |
       _cons |   1.593859   1.587583     1.00   0.315    -1.517747    4.705465
------------------------------------------------------------------------------

. * outreg2 using mnl_table, se bfmt(fc) bdec(3) tdec(3) bracket drop(year*) label title("Multinomial Logi
> t Model Results") eform tex append
. 
. estimates store ll2

. 
. fitstat

Measures of Fit for mlogit of state_y

Log-Lik Intercept Only:       -459.728   Log-Lik Full Model:           -358.516
D(394):                        717.033   LR(21):                        202.424
                                         Prob > LR:                       0.000
McFadden's R2:                   0.220   McFadden's Adj R2:               0.168
ML (Cox-Snell) R2:               0.384   Cragg-Uhler(Nagelkerke) R2:      0.432
Count R2:                        0.658   Adj Count R2:                    0.263
AIC:                             1.830   AIC*n:                         765.033
BIC:                         -1660.947   BIC':                          -75.678
BIC used by Stata:             861.885   AIC used by Stata:             765.033

. 
. mlogit, rrr

Multinomial logistic regression                 Number of obs     =        418
                                                LR chi2(21)       =     202.42
                                                Prob > chi2       =     0.0000
Log likelihood = -358.51649                     Pseudo R2         =     0.2202

------------------------------------------------------------------------------
     state_y |        RRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
     state_x |
          2  |   .0484437   .0597846    -2.45   0.014     .0043129    .5441386
          3  |   .0041612    .005573    -4.09   0.000     .0003015      .05744
          4  |   .0059565   .0093402    -3.27   0.001     .0002756    .1287461
             |
        year |
       2013  |    4069357   1.36e+10     0.00   0.996            0           .
       2014  |    2935356   9.81e+09     0.00   0.996            0           .
       2015  |    1274016   4.26e+09     0.00   0.997            0           .
       2016  |   5.24e+13   1.79e+17     0.01   0.993            0           .
             |
       _cons |   1.05e-06   .0034935    -0.00   0.997            0           .
-------------+----------------------------------------------------------------
2            |
     state_x |
          2  |   .1521748   .1718366    -1.67   0.095     .0166403    1.391632
          3  |    .037565   .0418066    -2.95   0.003      .004241    .3327351
          4  |   .0446571   .0516607    -2.69   0.007     .0046259     .431109
             |
        year |
       2013  |   .1463764   .0923677    -3.05   0.002     .0424951    .5042009
       2014  |   .0852536   .0578805    -3.63   0.000     .0225327    .3225609
       2015  |   .1037766   .0683931    -3.44   0.001     .0285182    .3776387
       2016  |    2358421   1.73e+09     0.02   0.984            0           .
             |
       _cons |   42.11334   52.79328     2.98   0.003     3.608722    491.4574
-------------+----------------------------------------------------------------
3            |  (base outcome)
-------------+----------------------------------------------------------------
4            |
     state_x |
          2  |    .525045   .7829188    -0.43   0.666     .0282443    9.760283
          3  |   .2362115    .348744    -0.98   0.328     .0130792    4.265991
          4  |   .5505923   .8196315    -0.40   0.689     .0297647    10.18496
             |
        year |
       2013  |   .1574409   .1042794    -2.79   0.005     .0429866    .5766368
       2014  |   .0650697   .0493415    -3.60   0.000     .0147206    .2876293
       2015  |   .1800607   .1208487    -2.55   0.011     .0483204    .6709763
       2016  |    7382901   5.42e+09     0.02   0.983            0           .
             |
       _cons |   4.922711   7.815214     1.00   0.315     .2192053    110.5497
------------------------------------------------------------------------------

. 
. 
. * Model #3: VIOL/OPINION COVARS
. mlogit state_y i.state_x army_casualties pres_approve , baseoutcome(3)

Iteration 0:   log likelihood =  -445.0471  
Iteration 1:   log likelihood = -440.13417  
Iteration 2:   log likelihood = -416.33036  (backed up)
Iteration 3:   log likelihood = -390.67358  (backed up)
Iteration 4:   log likelihood = -377.11327  
Iteration 5:   log likelihood = -373.87614  
Iteration 6:   log likelihood =  -373.4269  
Iteration 7:   log likelihood = -373.42479  
Iteration 8:   log likelihood = -373.42479  

Multinomial logistic regression                 Number of obs     =        410
                                                LR chi2(15)       =     143.24
                                                Prob > chi2       =     0.0000
Log likelihood = -373.42479                     Pseudo R2         =     0.1609

---------------------------------------------------------------------------------
        state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1               |
        state_x |
             2  |   -3.58733   1.275271    -2.81   0.005    -6.086815   -1.087845
             3  |  -5.776819    1.32774    -4.35   0.000    -8.379142   -3.174497
             4  |  -4.846329    1.52594    -3.18   0.001    -7.837117   -1.855541
                |
army_casualties |  -.1070232   .8421357    -0.13   0.899    -1.757579    1.543533
   pres_approve |   .1124182   1.910129     0.06   0.953    -3.631367    3.856203
          _cons |   1.277513   7.426445     0.17   0.863    -13.27805    15.83308
----------------+----------------------------------------------------------------
2               |
        state_x |
             2  |  -1.268573   1.151042    -1.10   0.270    -3.524573    .9874272
             3  |  -3.060805   1.138044    -2.69   0.007     -5.29133   -.8302794
             4  |   -2.25119   1.165791    -1.93   0.053    -4.536098    .0337188
                |
army_casualties |  -.4845892   .2696178    -1.80   0.072     -1.01303     .043852
   pres_approve |    2.01019    .727835     2.76   0.006     .5836591     3.43672
          _cons |  -5.088196   3.011604    -1.69   0.091    -10.99083    .8144394
----------------+----------------------------------------------------------------
3               |  (base outcome)
----------------+----------------------------------------------------------------
4               |
        state_x |
             2  |  -.4865452   1.450728    -0.34   0.737    -3.329921     2.35683
             3  |  -1.838827   1.434136    -1.28   0.200    -4.649683    .9720284
             4  |  -.0622794   1.440958    -0.04   0.966    -2.886505    2.761947
                |
army_casualties |    -1.0963   .2452103    -4.47   0.000    -1.576903   -.6156965
   pres_approve |   1.765514   .7375938     2.39   0.017     .3198568    3.211171
          _cons |  -3.594368   3.192558    -1.13   0.260    -9.851666     2.66293
---------------------------------------------------------------------------------

. fitstat

Measures of Fit for mlogit of state_y

Log-Lik Intercept Only:       -445.047   Log-Lik Full Model:           -373.425
D(392):                        746.850   LR(15):                        143.245
                                         Prob > LR:                       0.000
McFadden's R2:                   0.161   McFadden's Adj R2:               0.120
ML (Cox-Snell) R2:               0.295   Cragg-Uhler(Nagelkerke) R2:      0.333
Count R2:                        0.610   Adj Count R2:                    0.149
AIC:                             1.909   AIC*n:                         782.850
BIC:                         -1611.484   BIC':                          -53.002
BIC used by Stata:             855.140   AIC used by Stata:             782.850

. estimates store ll3

. 
. * Model #4: VIOL/OPINION COVARS PLUS YEAR
. mlogit state_y i.state_x FARC_actions peace_approve i.year , baseoutcome(3)

Iteration 0:   log likelihood = -421.33971  
Iteration 1:   log likelihood = -364.77779  
Iteration 2:   log likelihood = -357.24893  
Iteration 3:   log likelihood = -350.36868  (backed up)
Iteration 4:   log likelihood = -349.79098  
Iteration 5:   log likelihood = -339.67095  (backed up)
Iteration 6:   log likelihood = -335.63559  
Iteration 7:   log likelihood = -330.92089  
Iteration 8:   log likelihood = -330.12514  
Iteration 9:   log likelihood =  -329.9384  
Iteration 10:  log likelihood = -329.89387  
Iteration 11:  log likelihood = -329.88493  
Iteration 12:  log likelihood = -329.88346  
Iteration 13:  log likelihood = -329.88311  
Iteration 14:  log likelihood = -329.88303  
Iteration 15:  log likelihood = -329.88301  

Multinomial logistic regression                 Number of obs     =        401
                                                LR chi2(27)       =     182.91
                                                Prob > chi2       =     0.0000
Log likelihood = -329.88301                     Pseudo R2         =     0.2171

-------------------------------------------------------------------------------
      state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
1             |
      state_x |
           2  |  -2.344081   1.617307    -1.45   0.147    -5.513946    .8257826
           3  |  -4.088596   1.595273    -2.56   0.010    -7.215273    -.961918
           4  |  -2.955912   1.778708    -1.66   0.097    -6.442116    .5302928
              |
 FARC_actions |  -.4202891   .6257151    -0.67   0.502    -1.646668    .8060899
peace_approve |   1.042516   7.666706     0.14   0.892    -13.98395    16.06898
              |
         year |
        2013  |   15.14632   3034.556     0.00   0.996    -5932.475    5962.767
        2014  |   15.51595   3034.556     0.01   0.996    -5932.105    5963.137
        2015  |   13.23225   3034.557     0.00   0.997    -5934.389    5960.854
        2016  |   12.76615   4286.146     0.00   0.998    -8387.925    8413.457
              |
        _cons |  -17.81721   3034.745    -0.01   0.995    -5965.809    5930.174
--------------+----------------------------------------------------------------
2             |
      state_x |
           2  |  -1.611935   1.205729    -1.34   0.181    -3.975121      .75125
           3  |  -2.902747   1.186099    -2.45   0.014    -5.227459    -.578036
           4  |  -2.678025   1.232601    -2.17   0.030     -5.09388   -.2621713
              |
 FARC_actions |  -.2557774   .1783679    -1.43   0.152    -.6053721    .0938173
peace_approve |  -2.079295   2.429027    -0.86   0.392    -6.840102    2.681511
              |
         year |
        2013  |  -1.805451   .7172012    -2.52   0.012     -3.21114   -.3997627
        2014  |  -2.474217   .7333584    -3.37   0.001    -3.911573   -1.036861
        2015  |  -3.044717    .919875    -3.31   0.001    -4.847639   -1.241795
        2016  |   12.60266   516.9189     0.02   0.981     -1000.54    1025.745
              |
        _cons |   13.31625   10.97986     1.21   0.225    -8.203878    34.83639
--------------+----------------------------------------------------------------
3             |  (base outcome)
--------------+----------------------------------------------------------------
4             |
      state_x |
           2  |  -1.288324    1.48789    -0.87   0.387    -4.204534    1.627886
           3  |  -2.166943   1.461827    -1.48   0.138    -5.032071    .6981858
           4  |  -1.353548   1.485222    -0.91   0.362    -4.264529    1.557433
              |
 FARC_actions |   .0491502   .1841119     0.27   0.790    -.3117026    .4100029
peace_approve |   1.925584   2.515416     0.77   0.444     -3.00454    6.855708
              |
         year |
        2013  |  -1.654384   .7305417    -2.26   0.024     -3.08622   -.2225488
        2014  |  -2.746225   .8185549    -3.35   0.001    -4.350564   -1.141887
        2015  |   -1.21992   .9596943    -1.27   0.204    -3.100886    .6610467
        2016  |   15.66962    516.919     0.03   0.976     -997.473    1028.812
              |
        _cons |  -6.296891   11.45491    -0.55   0.583    -28.74811    16.15433
-------------------------------------------------------------------------------

. estimates store ll4

. 
. **************************************************************
. 
. * tests
. 
. 
. * Compare M1 and M2 LR
. * di "chi2(2) = " 2*(ll2-ll1)
. * di "Prob > chi2 = "chi2tail(2, 2*(ll2-ll1))
. lrtest ll1 ll2

Likelihood-ratio test                                 LR chi2(12) =     84.90
(Assumption: ll1 nested in ll2)                       Prob > chi2 =    0.0000

. 
. lrtest ll1 ll3 , force

Likelihood-ratio test                                 LR chi2(6)  =     55.09
(Assumption: ll1 nested in ll3)                       Prob > chi2 =    0.0000

. 
. lrtest ll1 ll4 , force

Likelihood-ratio test                                 LR chi2(18) =    142.17
(Assumption: ll1 nested in ll4)                       Prob > chi2 =    0.0000

. 
. * get rid of factor vars because mlogtest doesn't like them
. xi i.state_x i.year
i.state_x         _Istate_x_1-4       (naturally coded; _Istate_x_1 omitted)
i.year            _Iyear_1-5          (naturally coded; _Iyear_1 omitted)

. mlogit state_y _Is* army_casualties pres_approve _Iy*

Iteration 0:   log likelihood =  -445.0471  
Iteration 1:   log likelihood = -407.47369  
Iteration 2:   log likelihood = -375.19002  (backed up)
Iteration 3:   log likelihood = -354.72537  (backed up)
Iteration 4:   log likelihood =  -349.8409  
Iteration 5:   log likelihood = -338.97978  
Iteration 6:   log likelihood = -337.32808  
Iteration 7:   log likelihood = -330.90693  
Iteration 8:   log likelihood = -330.05008  
Iteration 9:   log likelihood = -329.92976  
Iteration 10:  log likelihood = -329.91263  
Iteration 11:  log likelihood = -329.91051  
Iteration 12:  log likelihood = -329.91015  
Iteration 13:  log likelihood = -329.91006  
Iteration 14:  log likelihood = -329.91004  

Multinomial logistic regression                 Number of obs     =        410
                                                LR chi2(27)       =     230.27
                                                Prob > chi2       =     0.0000
Log likelihood = -329.91004                     Pseudo R2         =     0.2587

---------------------------------------------------------------------------------
        state_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1               |
    _Istate_x_2 |    -3.3347   1.296287    -2.57   0.010    -5.875375   -.7940243
    _Istate_x_3 |  -5.459801   1.352644    -4.04   0.000    -8.110935   -2.808667
    _Istate_x_4 |  -4.440348   1.546345    -2.87   0.004    -7.471129   -1.409567
army_casualties |  -.8391405   1.101419    -0.76   0.446    -2.997882    1.319601
   pres_approve |   .0930327   2.922217     0.03   0.975    -5.634408    5.820473
       _Iyear_2 |   14.70245   2099.878     0.01   0.994    -4100.984    4130.389
       _Iyear_3 |   14.63472   2099.879     0.01   0.994    -4101.052    4130.322
       _Iyear_4 |   13.23263   2099.878     0.01   0.995    -4102.453    4128.919
       _Iyear_5 |   13.75372   3019.151     0.00   0.996    -5903.673    5931.181
          _cons |   -10.9578   2099.913    -0.01   0.996    -4126.711    4104.796
----------------+----------------------------------------------------------------
2               |
    _Istate_x_2 |  -1.789399    1.16153    -1.54   0.123    -4.065956    .4871582
    _Istate_x_3 |   -3.09645   1.143051    -2.71   0.007    -5.336789   -.8561122
    _Istate_x_4 |  -2.965643    1.19019    -2.49   0.013    -5.298373    -.632914
army_casualties |  -.1313228   .3200209    -0.41   0.682    -.7585523    .4959067
   pres_approve |   3.040483   1.384972     2.20   0.028     .3259873    5.754979
       _Iyear_2 |  -1.333109   .7048296    -1.89   0.059     -2.71455    .0483315
       _Iyear_3 |  -.9029014   .9692894    -0.93   0.352    -2.802674    .9968709
       _Iyear_4 |  -1.256139   .7858536    -1.60   0.110    -2.796384    .2841056
       _Iyear_5 |   15.23005   480.1351     0.03   0.975    -925.8174    956.2775
          _cons |  -9.111154   6.025238    -1.51   0.130     -20.9204    2.698095
----------------+----------------------------------------------------------------
3               |  (base outcome)
----------------+----------------------------------------------------------------
4               |
    _Istate_x_2 |   -1.40803   1.495343    -0.94   0.346    -4.338849    1.522789
    _Istate_x_3 |  -2.067542   1.471395    -1.41   0.160    -4.951424    .8163394
    _Istate_x_4 |  -1.749047   1.500533    -1.17   0.244    -4.690037    1.191944
army_casualties |   -.499756    .319958    -1.56   0.118    -1.126862    .1273502
   pres_approve |   8.284604   1.947394     4.25   0.000     4.467782    12.10143
       _Iyear_2 |  -.3000659   .7552221    -0.40   0.691    -1.780274    1.180142
       _Iyear_3 |   1.157558   1.163247     1.00   0.320    -1.122365     3.43748
       _Iyear_4 |   .6975789   .8601952     0.81   0.417    -.9883727     2.38353
       _Iyear_5 |   19.15492   480.1356     0.04   0.968    -921.8935    960.2034
          _cons |  -31.88069   8.462187    -3.77   0.000    -48.46627   -15.29511
---------------------------------------------------------------------------------

. mlogtest, lr

**** Likelihood-ratio tests for independent variables (N=410)

 Ho: All coefficients associated with given variable(s) are 0.

             |       chi2   df   P>chi2
-------------+-------------------------
 _Istate_x_2 |      8.838    5    0.116
 _Istate_x_3 |     25.838    5    0.000
 _Istate_x_4 |     15.469    5    0.009
army_casua~s |      2.993    6    0.810
pres_approve |     25.272    5    0.000
    _Iyear_2 |      5.834    4    0.212
    _Iyear_3 |      4.169    4    0.384
    _Iyear_4 |      6.788    4    0.148
    _Iyear_5 |     30.341    4    0.000
---------------------------------------

. mlogtest , hausman smhsiao base

**** Hausman tests of IIA assumption (N=410)

 Ho: Odds(Outcome-J vs Outcome-K) are independent of other alternatives.

 Omitted |      chi2   df   P>chi2   evidence
---------+------------------------------------
       1 |    -0.616    6     ---    ---       
       2 |     0.000    1    1.000   for Ho    
       4 |     0.000    2    1.000   for Ho    
       3 |    -0.000    1     ---    ---       
----------------------------------------------
 Note: If chi2<0, the estimated model does not
 meet asymptotic assumptions of the test.

**** Small-Hsiao tests of IIA assumption (N=410)

 Ho: Odds(Outcome-J vs Outcome-K) are independent of other alternatives.

 Omitted |  lnL(full)  lnL(omit)    chi2   df   P>chi2   evidence
---------+---------------------------------------------------------
       1 |   -161.217   -144.268  33.899   20    0.027   against Ho
       2 |    -66.909    -56.160  21.497   20    0.368   for Ho    
       4 |    -77.081    -73.599   6.963   20    0.997   for Ho    
       3 |    -67.059    -51.404  31.310   20    0.051   for Ho    
-------------------------------------------------------------------

. 
. * graphs graphs graphs
. 
. margins state_x, atmeans predict(outcome(1))
factor 'state_x' not found in list of covariates
r(322);

end of do-file

r(322);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD03784.000000"

. lrtest ll1 ll2

Likelihood-ratio test                                 LR chi2(12) =     84.90
(Assumption: ll1 nested in ll2)                       Prob > chi2 =    0.0000

. 
. lrtest ll1 ll3 , force

Likelihood-ratio test                                 LR chi2(6)  =     55.09
(Assumption: ll1 nested in ll3)                       Prob > chi2 =    0.0000

. 
. lrtest ll1 ll4 , force

Likelihood-ratio test                                 LR chi2(18) =    142.17
(Assumption: ll1 nested in ll4)                       Prob > chi2 =    0.0000

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD03784.000000"

. lrtest ll2 ll4, force

Likelihood-ratio test                                 LR chi2(6)  =     57.27
(Assumption: ll2 nested in ll4)                       Prob > chi2 =    0.0000

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD03784.000000"

. lrtest ll3 ll4
observations differ: 401 vs. 410
r(498);

end of do-file

r(498);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD03784.000000"

. lrtest ll3 ll4, force

Likelihood-ratio test                                 LR chi2(12) =     87.08
(Assumption: ll3 nested in ll4)                       Prob > chi2 =    0.0000

. 
end of do-file

