----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lesliehuang/Dropbox/MA-thesis-analysis/validate_log.log
  log type:  text
 opened on:   6 Sep 2016, 11:40:48

. 
. set seed 1234

. 
. * import data from R: already cleaned and transformed
. use validate_data.dta
(Written by R.              )

. 
. * convert dates to stata format
. gen statadate = date - td(01jan1960)

. format statadate %td

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. 
. logit joint_dummy i.F_est_state i.g_est_state i.F_est_state*i.g_est_state, or
variable F_est_state*i.g_est_state not found
r(111);

end of do-file

r(111);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. logit joint_dummy i.F_est_state i.g_est_state i.F_est_state#i.g_est_state, or

note: 1.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity
Iteration 0:   log likelihood = -332.72054  
Iteration 1:   log likelihood = -330.55066  
Iteration 2:   log likelihood = -330.48806  
Iteration 3:   log likelihood =  -330.4879  
Iteration 4:   log likelihood =  -330.4879  

Logistic regression                             Number of obs     =      1,464
                                                LR chi2(7)        =       4.47
                                                Prob > chi2       =     0.7249
Log likelihood =  -330.4879                     Pseudo R2         =     0.0067

-----------------------------------------------------------------------------------------
            joint_dummy | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   .6033755   .6532224    -0.47   0.641     .0722879    5.036279
                     3  |   .4044118    .460792    -0.79   0.427     .0433465    3.773062
                        |
            g_est_state |
                     1  |   .3666667   .5344086    -0.69   0.491       .02107    6.380857
                     3  |   2.357333   1.271524     1.59   0.112     .8190125    6.785025
                        |
F_est_state#g_est_state |
                   2#3  |          1  (empty)
                   1#1  |   3.634523   5.449736     0.86   0.389     .1923646    68.67045
                   1#3  |   .5858819   .4057675    -0.77   0.440     .1507609    2.276835
                   3#1  |   4.389457   6.778199     0.96   0.338     .2128067    90.53912
                   3#3  |          1  (omitted)
                        |
                  _cons |   .0909091   .0949514    -2.30   0.022      .011737    .7041389
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. logit joint_dummy i.F_est_state i.g_est_state i.F_est_state#i.g_est_state

note: 1.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity
Iteration 0:   log likelihood = -332.72054  
Iteration 1:   log likelihood = -330.55066  
Iteration 2:   log likelihood = -330.48806  
Iteration 3:   log likelihood =  -330.4879  
Iteration 4:   log likelihood =  -330.4879  

Logistic regression                             Number of obs     =      1,464
                                                LR chi2(7)        =       4.47
                                                Prob > chi2       =     0.7249
Log likelihood =  -330.4879                     Pseudo R2         =     0.0067

-----------------------------------------------------------------------------------------
            joint_dummy |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |  -.5052155   1.082613    -0.47   0.641    -2.627099    1.616668
                     3  |  -.9053217   1.139413    -0.79   0.427     -3.13853    1.327887
                        |
            g_est_state |
                     1  |  -1.003302   1.457478    -0.69   0.491    -3.859907    1.853302
                     3  |    .857531    .539391     1.59   0.112     -.199656    1.914718
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |   1.290478   1.499436     0.86   0.389    -1.648363    4.229319
                   1#3  |  -.5346371   .6925756    -0.77   0.440     -1.89206    .8227861
                   3#1  |   1.479205     1.5442     0.96   0.338    -1.547371    4.505782
                   3#3  |          0  (omitted)
                        |
                  _cons |  -2.397895   1.044466    -2.30   0.022    -4.445011   -.3507797
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. reg EmoNeg i.F_est_state i.g_est_state i.F_est_state#i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.82
       Model |  145.976506         7  20.8537865   Prob > F        =    0.0943
    Residual |   915.73542        80  11.4466927   R-squared       =    0.1375
-------------+----------------------------------   Adj R-squared   =    0.0620
       Total |  1061.71193        87  12.2035853   Root MSE        =    3.3833

-----------------------------------------------------------------------------------------
                 EmoNeg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   .3863846   3.511012     0.11   0.913    -6.600753    7.373522
                     3  |    1.23286   3.706215     0.33   0.740    -6.142743    8.608463
                        |
            g_est_state |
                     1  |     10.298   4.784703     2.15   0.034      .776137    19.81986
                     3  |   1.454186   1.780408     0.82   0.416    -2.088939    4.997311
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -8.768501   4.922577    -1.78   0.079    -18.56474    1.027741
                   1#3  |   1.287279   2.279262     0.56   0.574    -3.248598    5.823156
                   3#1  |  -10.59478   5.074944    -2.09   0.040    -20.69425   -.4953242
                   3#3  |          0  (omitted)
                        |
                  _cons |      .2283   3.383296     0.07   0.946    -6.504674    6.961274
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. reg EmoPos i.F_est_state i.g_est_state i.F_est_state#i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.79
       Model |  5371.40393         7  767.343418   Prob > F        =    0.1009
    Residual |  34318.1805        80  428.977256   R-squared       =    0.1353
-------------+----------------------------------   Adj R-squared   =    0.0597
       Total |  39689.5844        87   456.20212   Root MSE        =    20.712

-----------------------------------------------------------------------------------------
                 EmoPos |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   5.466077   21.49362     0.25   0.800    -37.30758    48.23973
                     3  |    15.5268    22.6886     0.68   0.496    -29.62496    60.67856
                        |
            g_est_state |
                     1  |     72.369   29.29086     2.47   0.016     14.07833    130.6597
                     3  |  -3.481877   10.89925    -0.32   0.750    -25.17208    18.20833
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -66.57164   30.13489    -2.21   0.030     -126.542   -6.601286
                   1#3  |    19.4634   13.95312     1.39   0.167    -8.304202      47.231
                   3#1  |  -77.69815   31.06765    -2.50   0.014    -139.5247   -15.87156
                   3#3  |          0  (omitted)
                        |
                  _cons |      3.947   20.71177     0.19   0.849    -37.27073    45.16473
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. logit joint_dummy i.F_est_state##i.g_est_state

note: 1.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity
Iteration 0:   log likelihood = -332.72054  
Iteration 1:   log likelihood = -330.55066  
Iteration 2:   log likelihood = -330.48806  
Iteration 3:   log likelihood =  -330.4879  
Iteration 4:   log likelihood =  -330.4879  

Logistic regression                             Number of obs     =      1,464
                                                LR chi2(7)        =       4.47
                                                Prob > chi2       =     0.7249
Log likelihood =  -330.4879                     Pseudo R2         =     0.0067

-----------------------------------------------------------------------------------------
            joint_dummy |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |  -.5052155   1.082613    -0.47   0.641    -2.627099    1.616668
                     3  |  -.9053217   1.139413    -0.79   0.427     -3.13853    1.327887
                        |
            g_est_state |
                     1  |  -1.003302   1.457478    -0.69   0.491    -3.859907    1.853302
                     3  |    .857531    .539391     1.59   0.112     -.199656    1.914718
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |   1.290478   1.499436     0.86   0.389    -1.648363    4.229319
                   1#3  |  -.5346371   .6925756    -0.77   0.440     -1.89206    .8227861
                   3#1  |   1.479205     1.5442     0.96   0.338    -1.547371    4.505782
                   3#3  |          0  (omitted)
                        |
                  _cons |  -2.397895   1.044466    -2.30   0.022    -4.445011   -.3507797
-----------------------------------------------------------------------------------------

. n term
command term is unrecognized
r(199);

end of do-file

r(199);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. 
. * run reg Emo ~ est state w/ linear interaction term
. reg EmoNegi.F_est_state##i.g_est_state
EmoNegi.F_est_state invalid name
r(198);

end of do-file

r(198);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. reg EmoNeg i.F_est_state##i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.82
       Model |  145.976506         7  20.8537865   Prob > F        =    0.0943
    Residual |   915.73542        80  11.4466927   R-squared       =    0.1375
-------------+----------------------------------   Adj R-squared   =    0.0620
       Total |  1061.71193        87  12.2035853   Root MSE        =    3.3833

-----------------------------------------------------------------------------------------
                 EmoNeg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   .3863846   3.511012     0.11   0.913    -6.600753    7.373522
                     3  |    1.23286   3.706215     0.33   0.740    -6.142743    8.608463
                        |
            g_est_state |
                     1  |     10.298   4.784703     2.15   0.034      .776137    19.81986
                     3  |   1.454186   1.780408     0.82   0.416    -2.088939    4.997311
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -8.768501   4.922577    -1.78   0.079    -18.56474    1.027741
                   1#3  |   1.287279   2.279262     0.56   0.574    -3.248598    5.823156
                   3#1  |  -10.59478   5.074944    -2.09   0.040    -20.69425   -.4953242
                   3#3  |          0  (omitted)
                        |
                  _cons |      .2283   3.383296     0.07   0.946    -6.504674    6.961274
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. reg EmoPos i.F_est_state##i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.79
       Model |  5371.40393         7  767.343418   Prob > F        =    0.1009
    Residual |  34318.1805        80  428.977256   R-squared       =    0.1353
-------------+----------------------------------   Adj R-squared   =    0.0597
       Total |  39689.5844        87   456.20212   Root MSE        =    20.712

-----------------------------------------------------------------------------------------
                 EmoPos |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   5.466077   21.49362     0.25   0.800    -37.30758    48.23973
                     3  |    15.5268    22.6886     0.68   0.496    -29.62496    60.67856
                        |
            g_est_state |
                     1  |     72.369   29.29086     2.47   0.016     14.07833    130.6597
                     3  |  -3.481877   10.89925    -0.32   0.750    -25.17208    18.20833
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -66.57164   30.13489    -2.21   0.030     -126.542   -6.601286
                   1#3  |    19.4634   13.95312     1.39   0.167    -8.304202      47.231
                   3#1  |  -77.69815   31.06765    -2.50   0.014    -139.5247   -15.87156
                   3#3  |          0  (omitted)
                        |
                  _cons |      3.947   20.71177     0.19   0.849    -37.27073    45.16473
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. 
. * run reg Emo ~ est state w/ linear interaction term
. reg EmoNeg i.F_est_state##i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.82
       Model |  145.976506         7  20.8537865   Prob > F        =    0.0943
    Residual |   915.73542        80  11.4466927   R-squared       =    0.1375
-------------+----------------------------------   Adj R-squared   =    0.0620
       Total |  1061.71193        87  12.2035853   Root MSE        =    3.3833

-----------------------------------------------------------------------------------------
                 EmoNeg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   .3863846   3.511012     0.11   0.913    -6.600753    7.373522
                     3  |    1.23286   3.706215     0.33   0.740    -6.142743    8.608463
                        |
            g_est_state |
                     1  |     10.298   4.784703     2.15   0.034      .776137    19.81986
                     3  |   1.454186   1.780408     0.82   0.416    -2.088939    4.997311
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -8.768501   4.922577    -1.78   0.079    -18.56474    1.027741
                   1#3  |   1.287279   2.279262     0.56   0.574    -3.248598    5.823156
                   3#1  |  -10.59478   5.074944    -2.09   0.040    -20.69425   -.4953242
                   3#3  |          0  (omitted)
                        |
                  _cons |      .2283   3.383296     0.07   0.946    -6.504674    6.961274
-----------------------------------------------------------------------------------------

. outreg2 using reg, tex title("Joint statement sentiment") label parenthesis(se) eform coefas
> tr symb(***,**,*) rdec(3) bdec(3) ctitle("Coefficient") nocons r2 addstat(Pseudo R2, e(r2_p)
> , chi2, e(N)) nonotes replace
check eret list for the existence of e(r2_p)
invalid syntax
r(198);

end of do-file

r(198);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. 
. * run reg Emo ~ est state w/ linear interaction term
. reg EmoNeg i.F_est_state##i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.82
       Model |  145.976506         7  20.8537865   Prob > F        =    0.0943
    Residual |   915.73542        80  11.4466927   R-squared       =    0.1375
-------------+----------------------------------   Adj R-squared   =    0.0620
       Total |  1061.71193        87  12.2035853   Root MSE        =    3.3833

-----------------------------------------------------------------------------------------
                 EmoNeg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   .3863846   3.511012     0.11   0.913    -6.600753    7.373522
                     3  |    1.23286   3.706215     0.33   0.740    -6.142743    8.608463
                        |
            g_est_state |
                     1  |     10.298   4.784703     2.15   0.034      .776137    19.81986
                     3  |   1.454186   1.780408     0.82   0.416    -2.088939    4.997311
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -8.768501   4.922577    -1.78   0.079    -18.56474    1.027741
                   1#3  |   1.287279   2.279262     0.56   0.574    -3.248598    5.823156
                   3#1  |  -10.59478   5.074944    -2.09   0.040    -20.69425   -.4953242
                   3#3  |          0  (omitted)
                        |
                  _cons |      .2283   3.383296     0.07   0.946    -6.504674    6.961274
-----------------------------------------------------------------------------------------

. outreg2 using reg, tex title("Joint statement sentiment") label parenthesis(se) eform coefas
> tr symb(***,**,*) rdec(3) bdec(3) ctitle("Coefficient") nocons r2 addstat(Pseudo R2, e(r2_p)
> , chi2, e(N)) nonotes replace
check eret list for the existence of e(r2_p)
invalid syntax
r(198);

end of do-file

r(198);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. 
. * run reg Emo ~ est state w/ linear interaction term
. reg EmoNeg i.F_est_state##i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.82
       Model |  145.976506         7  20.8537865   Prob > F        =    0.0943
    Residual |   915.73542        80  11.4466927   R-squared       =    0.1375
-------------+----------------------------------   Adj R-squared   =    0.0620
       Total |  1061.71193        87  12.2035853   Root MSE        =    3.3833

-----------------------------------------------------------------------------------------
                 EmoNeg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   .3863846   3.511012     0.11   0.913    -6.600753    7.373522
                     3  |    1.23286   3.706215     0.33   0.740    -6.142743    8.608463
                        |
            g_est_state |
                     1  |     10.298   4.784703     2.15   0.034      .776137    19.81986
                     3  |   1.454186   1.780408     0.82   0.416    -2.088939    4.997311
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -8.768501   4.922577    -1.78   0.079    -18.56474    1.027741
                   1#3  |   1.287279   2.279262     0.56   0.574    -3.248598    5.823156
                   3#1  |  -10.59478   5.074944    -2.09   0.040    -20.69425   -.4953242
                   3#3  |          0  (omitted)
                        |
                  _cons |      .2283   3.383296     0.07   0.946    -6.504674    6.961274
-----------------------------------------------------------------------------------------

. outreg2 using reg, tex title("Joint statement sentiment") label parenthesis(se) eform coefas
> tr symb(***,**,*) rdec(3) bdec(3) ctitle("Coefficient") nocons r2 addstat(Pseudo R2, chi2, e
> (N)) nonotes replace
chi2 not found
r(111);

end of do-file

r(111);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. 
. * run reg Emo ~ est state w/ linear interaction term
. reg EmoNeg i.F_est_state##i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.82
       Model |  145.976506         7  20.8537865   Prob > F        =    0.0943
    Residual |   915.73542        80  11.4466927   R-squared       =    0.1375
-------------+----------------------------------   Adj R-squared   =    0.0620
       Total |  1061.71193        87  12.2035853   Root MSE        =    3.3833

-----------------------------------------------------------------------------------------
                 EmoNeg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   .3863846   3.511012     0.11   0.913    -6.600753    7.373522
                     3  |    1.23286   3.706215     0.33   0.740    -6.142743    8.608463
                        |
            g_est_state |
                     1  |     10.298   4.784703     2.15   0.034      .776137    19.81986
                     3  |   1.454186   1.780408     0.82   0.416    -2.088939    4.997311
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -8.768501   4.922577    -1.78   0.079    -18.56474    1.027741
                   1#3  |   1.287279   2.279262     0.56   0.574    -3.248598    5.823156
                   3#1  |  -10.59478   5.074944    -2.09   0.040    -20.69425   -.4953242
                   3#3  |          0  (omitted)
                        |
                  _cons |      .2283   3.383296     0.07   0.946    -6.504674    6.961274
-----------------------------------------------------------------------------------------

. outreg2 using reg, tex title("Joint statement sentiment") label parenthesis(se) eform coefas
> tr symb(***,**,*) rdec(3) bdec(3) ctitle("Coefficient") nocons r2 addstat(Pseudo R2, e(N)) n
> onotes replace
reg.tex
dir : seeout

. 
. reg EmoPos i.F_est_state##i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.79
       Model |  5371.40393         7  767.343418   Prob > F        =    0.1009
    Residual |  34318.1805        80  428.977256   R-squared       =    0.1353
-------------+----------------------------------   Adj R-squared   =    0.0597
       Total |  39689.5844        87   456.20212   Root MSE        =    20.712

-----------------------------------------------------------------------------------------
                 EmoPos |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   5.466077   21.49362     0.25   0.800    -37.30758    48.23973
                     3  |    15.5268    22.6886     0.68   0.496    -29.62496    60.67856
                        |
            g_est_state |
                     1  |     72.369   29.29086     2.47   0.016     14.07833    130.6597
                     3  |  -3.481877   10.89925    -0.32   0.750    -25.17208    18.20833
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -66.57164   30.13489    -2.21   0.030     -126.542   -6.601286
                   1#3  |    19.4634   13.95312     1.39   0.167    -8.304202      47.231
                   3#1  |  -77.69815   31.06765    -2.50   0.014    -139.5247   -15.87156
                   3#3  |          0  (omitted)
                        |
                  _cons |      3.947   20.71177     0.19   0.849    -37.27073    45.16473
-----------------------------------------------------------------------------------------

. outreg2 using reg, tex title("Joint statement sentiment") label parenthesis(se) eform coefas
> tr symb(***,**,*) rdec(3) bdec(3) ctitle("Coefficient") nocons r2 addstat(Pseudo R2,e(N)) no
> notes append
reg.tex
dir : seeout

. 
end of do-file

. seeout using "reg.txt", label
Hit Enter to continue. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. 
. * run reg Emo ~ est state w/ linear interaction term
. reg EmoNeg i.F_est_state##i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.82
       Model |  145.976506         7  20.8537865   Prob > F        =    0.0943
    Residual |   915.73542        80  11.4466927   R-squared       =    0.1375
-------------+----------------------------------   Adj R-squared   =    0.0620
       Total |  1061.71193        87  12.2035853   Root MSE        =    3.3833

-----------------------------------------------------------------------------------------
                 EmoNeg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   .3863846   3.511012     0.11   0.913    -6.600753    7.373522
                     3  |    1.23286   3.706215     0.33   0.740    -6.142743    8.608463
                        |
            g_est_state |
                     1  |     10.298   4.784703     2.15   0.034      .776137    19.81986
                     3  |   1.454186   1.780408     0.82   0.416    -2.088939    4.997311
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -8.768501   4.922577    -1.78   0.079    -18.56474    1.027741
                   1#3  |   1.287279   2.279262     0.56   0.574    -3.248598    5.823156
                   3#1  |  -10.59478   5.074944    -2.09   0.040    -20.69425   -.4953242
                   3#3  |          0  (omitted)
                        |
                  _cons |      .2283   3.383296     0.07   0.946    -6.504674    6.961274
-----------------------------------------------------------------------------------------

. outreg2 using reg_results, tex title("Joint statement sentiment") label parenthesis(se) eform coefast
> r symb(***,**,*) rdec(3) bdec(3) ctitle("Coefficient") nocons r2 addstat(Pseudo R2, e(N)) nonotes rep
> lace
reg_results.tex
dir : seeout

. 
. reg EmoPos i.F_est_state##i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.79
       Model |  5371.40393         7  767.343418   Prob > F        =    0.1009
    Residual |  34318.1805        80  428.977256   R-squared       =    0.1353
-------------+----------------------------------   Adj R-squared   =    0.0597
       Total |  39689.5844        87   456.20212   Root MSE        =    20.712

-----------------------------------------------------------------------------------------
                 EmoPos |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   5.466077   21.49362     0.25   0.800    -37.30758    48.23973
                     3  |    15.5268    22.6886     0.68   0.496    -29.62496    60.67856
                        |
            g_est_state |
                     1  |     72.369   29.29086     2.47   0.016     14.07833    130.6597
                     3  |  -3.481877   10.89925    -0.32   0.750    -25.17208    18.20833
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -66.57164   30.13489    -2.21   0.030     -126.542   -6.601286
                   1#3  |    19.4634   13.95312     1.39   0.167    -8.304202      47.231
                   3#1  |  -77.69815   31.06765    -2.50   0.014    -139.5247   -15.87156
                   3#3  |          0  (omitted)
                        |
                  _cons |      3.947   20.71177     0.19   0.849    -37.27073    45.16473
-----------------------------------------------------------------------------------------

. outreg2 using reg_results, tex title("Joint statement sentiment") label parenthesis(se) eform coefast
> r symb(***,**,*) rdec(3) bdec(3) ctitle("Coefficient") nocons r2 addstat(Pseudo R2,e(N)) nonotes appe
> nd
reg_results.tex
dir : seeout

. 
end of do-file

. shellout using `"reg_results.tex"'
shellout probably will not work with MacOSX

/bin/bash: reg_results.tex: command not found

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. reg EmoNeg i.F_est_state##i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.82
       Model |  145.976506         7  20.8537865   Prob > F        =    0.0943
    Residual |   915.73542        80  11.4466927   R-squared       =    0.1375
-------------+----------------------------------   Adj R-squared   =    0.0620
       Total |  1061.71193        87  12.2035853   Root MSE        =    3.3833

-----------------------------------------------------------------------------------------
                 EmoNeg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   .3863846   3.511012     0.11   0.913    -6.600753    7.373522
                     3  |    1.23286   3.706215     0.33   0.740    -6.142743    8.608463
                        |
            g_est_state |
                     1  |     10.298   4.784703     2.15   0.034      .776137    19.81986
                     3  |   1.454186   1.780408     0.82   0.416    -2.088939    4.997311
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -8.768501   4.922577    -1.78   0.079    -18.56474    1.027741
                   1#3  |   1.287279   2.279262     0.56   0.574    -3.248598    5.823156
                   3#1  |  -10.59478   5.074944    -2.09   0.040    -20.69425   -.4953242
                   3#3  |          0  (omitted)
                        |
                  _cons |      .2283   3.383296     0.07   0.946    -6.504674    6.961274
-----------------------------------------------------------------------------------------

. outreg2 using reg_results, tex title("Joint statement sentiment") label parenthesis(se) coefastr symb
> (***,**,*) rdec(3) bdec(3) ctitle("Coefficient") nocons r2 addstat(Pseudo R2, e(N)) nonotes replace
reg_results.tex
dir : seeout

. 
. reg EmoPos i.F_est_state##i.g_est_state
note: 1b.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =        88
-------------+----------------------------------   F(7, 80)        =      1.79
       Model |  5371.40393         7  767.343418   Prob > F        =    0.1009
    Residual |  34318.1805        80  428.977256   R-squared       =    0.1353
-------------+----------------------------------   Adj R-squared   =    0.0597
       Total |  39689.5844        87   456.20212   Root MSE        =    20.712

-----------------------------------------------------------------------------------------
                 EmoPos |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   5.466077   21.49362     0.25   0.800    -37.30758    48.23973
                     3  |    15.5268    22.6886     0.68   0.496    -29.62496    60.67856
                        |
            g_est_state |
                     1  |     72.369   29.29086     2.47   0.016     14.07833    130.6597
                     3  |  -3.481877   10.89925    -0.32   0.750    -25.17208    18.20833
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |  -66.57164   30.13489    -2.21   0.030     -126.542   -6.601286
                   1#3  |    19.4634   13.95312     1.39   0.167    -8.304202      47.231
                   3#1  |  -77.69815   31.06765    -2.50   0.014    -139.5247   -15.87156
                   3#3  |          0  (omitted)
                        |
                  _cons |      3.947   20.71177     0.19   0.849    -37.27073    45.16473
-----------------------------------------------------------------------------------------

. outreg2 using reg_results, tex title("Joint statement sentiment") label parenthesis(se) coefastr symb
> (***,**,*) rdec(3) bdec(3) ctitle("Coefficient") nocons r2 addstat(Pseudo R2,e(N)) nonotes append
reg_results.tex
dir : seeout

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. logit joint_dummy i.F_est_state##i.g_est_state

note: 1.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity
Iteration 0:   log likelihood = -332.72054  
Iteration 1:   log likelihood = -330.55066  
Iteration 2:   log likelihood = -330.48806  
Iteration 3:   log likelihood =  -330.4879  
Iteration 4:   log likelihood =  -330.4879  

Logistic regression                             Number of obs     =      1,464
                                                LR chi2(7)        =       4.47
                                                Prob > chi2       =     0.7249
Log likelihood =  -330.4879                     Pseudo R2         =     0.0067

-----------------------------------------------------------------------------------------
            joint_dummy |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |  -.5052155   1.082613    -0.47   0.641    -2.627099    1.616668
                     3  |  -.9053217   1.139413    -0.79   0.427     -3.13853    1.327887
                        |
            g_est_state |
                     1  |  -1.003302   1.457478    -0.69   0.491    -3.859907    1.853302
                     3  |    .857531    .539391     1.59   0.112     -.199656    1.914718
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |   1.290478   1.499436     0.86   0.389    -1.648363    4.229319
                   1#3  |  -.5346371   .6925756    -0.77   0.440     -1.89206    .8227861
                   3#1  |   1.479205     1.5442     0.96   0.338    -1.547371    4.505782
                   3#3  |          0  (omitted)
                        |
                  _cons |  -2.397895   1.044466    -2.30   0.022    -4.445011   -.3507797
-----------------------------------------------------------------------------------------

. 
end of do-file

. xi: logit joint_dummy i.F_est_state##i.g_est_state
interactions not allowed
r(101);

. 
. logit joint_dummy i.F_est_state i.g_est_state

Iteration 0:   log likelihood = -332.72054  
Iteration 1:   log likelihood = -331.23727  
Iteration 2:   log likelihood = -331.21852  
Iteration 3:   log likelihood = -331.21852  

Logistic regression                             Number of obs     =      1,464
                                                LR chi2(4)        =       3.00
                                                Prob > chi2       =     0.5571
Log likelihood = -331.21852                     Pseudo R2         =     0.0045

------------------------------------------------------------------------------
 joint_dummy |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 F_est_state |
          1  |   .2892195   .7425847     0.39   0.697     -1.16622    1.744659
          3  |   .1404868   .7473129     0.19   0.851     -1.32422    1.605193
             |
 g_est_state |
          1  |   .2910259     .28159     1.03   0.301    -.2608803    .8429322
          3  |   .5191966   .3226294     1.61   0.108    -.1131453    1.151539
             |
       _cons |  -3.237683   .7562353    -4.28   0.000    -4.719877   -1.755489
------------------------------------------------------------------------------

. 
. xi: logit joint_dummy i.F_est_state i.g_est_state
i.F_est_state     _IF_est_sta_1-3     (naturally coded; _IF_est_sta_1 omitted)
i.g_est_state     _Ig_est_sta_1-3     (naturally coded; _Ig_est_sta_1 omitted)

Iteration 0:   log likelihood = -332.72054  
Iteration 1:   log likelihood = -331.23727  
Iteration 2:   log likelihood = -331.21852  
Iteration 3:   log likelihood = -331.21852  

Logistic regression                             Number of obs     =      1,464
                                                LR chi2(4)        =       3.00
                                                Prob > chi2       =     0.5571
Log likelihood = -331.21852                     Pseudo R2         =     0.0045

-------------------------------------------------------------------------------
  joint_dummy |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
_IF_est_sta_2 |   .2892195   .7425847     0.39   0.697     -1.16622    1.744659
_IF_est_sta_3 |   .1404868   .7473129     0.19   0.851     -1.32422    1.605193
_Ig_est_sta_2 |   .2910259     .28159     1.03   0.301    -.2608803    .8429322
_Ig_est_sta_3 |   .5191966   .3226294     1.61   0.108    -.1131453    1.151539
        _cons |  -3.237683   .7562353    -4.28   0.000    -4.719877   -1.755489
-------------------------------------------------------------------------------

. 
. adjust, by(i.F_est_state i.g_est_state) exp
factor variables and time-series operators not allowed
(error in option by())
r(101);

. 
. adjust, by(F_est_state g_est_state) exp

-------------------------------------------------------------------------------------------------------
     Dependent variable: joint_dummy     Equation: joint_dummy     Command: logit
   Variables left as is: _IF_est_st~2, _IF_est_st~3, _Ig_est_st~2, _Ig_est_st~3
-------------------------------------------------------------------------------------------------------

-------------------------------------
F_est_sta |        g_est_state       
te        |       2        1        3
----------+--------------------------
        2 | .039255  .052515         
        1 |  .05242  .070128  .088101
        3 | .045176  .060436  .075926
-------------------------------------
     Key:  exp(xb)

. 
. adjust, by(F_est_state##g_est_state) exp
interactions not allowed
(error in option by())
r(101);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. logit joint_dummy i.F_est_state##i.g_est_state

note: 1.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity
Iteration 0:   log likelihood = -332.72054  
Iteration 1:   log likelihood = -330.55066  
Iteration 2:   log likelihood = -330.48806  
Iteration 3:   log likelihood =  -330.4879  
Iteration 4:   log likelihood =  -330.4879  

Logistic regression                             Number of obs     =      1,464
                                                LR chi2(7)        =       4.47
                                                Prob > chi2       =     0.7249
Log likelihood =  -330.4879                     Pseudo R2         =     0.0067

-----------------------------------------------------------------------------------------
            joint_dummy |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |  -.5052155   1.082613    -0.47   0.641    -2.627099    1.616668
                     3  |  -.9053217   1.139413    -0.79   0.427     -3.13853    1.327887
                        |
            g_est_state |
                     1  |  -1.003302   1.457478    -0.69   0.491    -3.859907    1.853302
                     3  |    .857531    .539391     1.59   0.112     -.199656    1.914718
                        |
F_est_state#g_est_state |
                   2#3  |          0  (empty)
                   1#1  |   1.290478   1.499436     0.86   0.389    -1.648363    4.229319
                   1#3  |  -.5346371   .6925756    -0.77   0.440     -1.89206    .8227861
                   3#1  |   1.479205     1.5442     0.96   0.338    -1.547371    4.505782
                   3#3  |          0  (omitted)
                        |
                  _cons |  -2.397895   1.044466    -2.30   0.022    -4.445011   -.3507797
-----------------------------------------------------------------------------------------

. , or
, is not a valid command name
r(199);

end of do-file

r(199);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. logit joint_dummy i.F_est_state##i.g_est_state , or

note: 1.F_est_state#3.g_est_state identifies no observations in the sample
note: 3.F_est_state#3.g_est_state omitted because of collinearity
Iteration 0:   log likelihood = -332.72054  
Iteration 1:   log likelihood = -330.55066  
Iteration 2:   log likelihood = -330.48806  
Iteration 3:   log likelihood =  -330.4879  
Iteration 4:   log likelihood =  -330.4879  

Logistic regression                             Number of obs     =      1,464
                                                LR chi2(7)        =       4.47
                                                Prob > chi2       =     0.7249
Log likelihood =  -330.4879                     Pseudo R2         =     0.0067

-----------------------------------------------------------------------------------------
            joint_dummy | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
            F_est_state |
                     1  |   .6033755   .6532224    -0.47   0.641     .0722879    5.036279
                     3  |   .4044118    .460792    -0.79   0.427     .0433465    3.773062
                        |
            g_est_state |
                     1  |   .3666667   .5344086    -0.69   0.491       .02107    6.380857
                     3  |   2.357333   1.271524     1.59   0.112     .8190125    6.785025
                        |
F_est_state#g_est_state |
                   2#3  |          1  (empty)
                   1#1  |   3.634523   5.449736     0.86   0.389     .1923646    68.67045
                   1#3  |   .5858819   .4057675    -0.77   0.440     .1507609    2.276835
                   3#1  |   4.389457   6.778199     0.96   0.338     .2128067    90.53912
                   3#3  |          1  (omitted)
                        |
                  _cons |   .0909091   .0949514    -2.30   0.022      .011737    .7041389
-----------------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.000000"

. outreg2 using validate_logit, tex title("Joint statement issuance") label parenthesis(se) ef
> orm coefastr symb(***,**,*) rdec(3) bdec(3) ctitle("Coefficient") nocons r2 addstat(Pseudo R
> 2, e(r2_p), chi2, e(N)) nonotes replace
validate_logit.tex
dir : seeout

. 
end of do-file

. tab F_est_state g_est_state

F_est_stat |           g_est_state
         e |         2          1          3 |     Total
-----------+---------------------------------+----------
         2 |        12         31          0 |        43 
         1 |       250        367        142 |       759 
         3 |       141        358        163 |       662 
-----------+---------------------------------+----------
     Total |       403        756        305 |     1,464 


. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD05302.00000
> 0"

. logit joint_dummy i.F_est_state##i.g_est_state , rrr
option rrr not allowed
r(198);

end of do-file

r(198);

. logit joint_dummy i.F_est_state##i.g_est_state , rr
option rr not allowed
r(198);

